MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
typedef struct stc_rtc_wttr0_field
{
  __IO  uint8_t TM0        : 1;
  __IO  uint8_t TM1        : 1;
  __IO  uint8_t TM2        : 1;
  __IO  uint8_t TM3        : 1;
  __IO  uint8_t TM4        : 1;
  __IO  uint8_t TM5        : 1;
  __IO  uint8_t TM6        : 1;
  __IO  uint8_t TM7        : 1;
} stc_rtc_wttr0_field_t;

typedef struct stc_rtc_wttr1_field
{
  __IO  uint8_t TM8        : 1;
  __IO  uint8_t TM9        : 1;
  __IO  uint8_t TM10       : 1;
  __IO  uint8_t TM11       : 1;
  __IO  uint8_t TM12       : 1;
  __IO  uint8_t TM13       : 1;
  __IO  uint8_t TM14       : 1;
  __IO  uint8_t TM15       : 1;
} stc_rtc_wttr1_field_t;

typedef struct stc_rtc_wttr2_field
{
  __IO  uint8_t TM16       : 1;
  __IO  uint8_t TM17       : 1;
        uint8_t RESERVED1  : 6;
} stc_rtc_wttr2_field_t;

/* RTC CLK */
typedef struct stc_rtc_wtcal1_field
{
  union {
    struct {
      __IO  uint8_t WTCAL1     : 2;
            uint8_t RESERVED1  : 6;
    };
    struct {
      __IO  uint8_t WTCAL10    : 1;
      __IO  uint8_t WTCAL11    : 1;
            uint8_t RESERVED2  : 6;
    };
  };
} stc_rtc_wtcal1_field_t;

typedef struct stc_rtc_wtcalen_field
{
  __IO  uint8_t WTCALEN    : 1;
        uint8_t RESERVED1  : 7;
} stc_rtc_wtcalen_field_t;

typedef struct stc_rtc_wtdiv_field
{
  union {
    struct {
      __IO  uint8_t WTDIV      : 4;
            uint8_t RESERVED1  : 4;
    };
    struct {
      __IO  uint8_t WTDIV0     : 1;
      __IO  uint8_t WTDIV1     : 1;
      __IO  uint8_t WTDIV2     : 1;
      __IO  uint8_t WTDIV3     : 1;
            uint8_t RESERVED2  : 4;
    };
  };
} stc_rtc_wtdiv_field_t;

typedef struct stc_rtc_wtdiven_field
{
  __IO  uint8_t WTDIVEN    : 1;
  __IO  uint8_t WTDIVRDY   : 1;
        uint8_t RESERVED1  : 6;
} stc_rtc_wtdiven_field_t;

typedef struct stc_rtc_wtcalprd_field
{
  union {
    struct {
      __IO  uint8_t WTCALPRD   : 6;
            uint8_t RESERVED1  : 2;
    };
    struct {
      __IO  uint8_t WTCALPRD0  : 1;
      __IO  uint8_t WTCALPRD1  : 1;
      __IO  uint8_t WTCALPRD2  : 1;
      __IO  uint8_t WTCALPRD3  : 1;
      __IO  uint8_t WTCALPRD4  : 1;
      __IO  uint8_t WTCALPRD5  : 1;
            uint8_t RESERVED2  : 2;
    };
  };
} stc_rtc_wtcalprd_field_t;

typedef struct stc_rtc_wtcosel_field
{
  __IO  uint8_t WTCOSEL    : 1;
  __IO  uint8_t WTDIVRDY   : 7;
} stc_rtc_wtcosel_field_t;

/* VBVat Domain */
typedef struct stc_rtc_vb_clkdiv_field
{
  __IO  uint8_t DIV        : 8;
} stc_rtc_vb_clkdiv_field_t;

typedef struct stc_rtc_wtosccnt_field
{
  __IO  uint8_t SOSCEX     : 1;
  __IO  uint8_t SOSCNTL    : 1;
} stc_rtc_wtosccnt_field_t;

typedef struct stc_rtc_boost_field
{
  __IO  uint8_t BOOST      : 2;
} stc_rtc_boost_field_t;

typedef struct stc_rtc_ewkup_field
{
  __IO  uint8_t WUP0       : 1;
} stc_rtc_ewkup_field_t;

typedef struct stc_rtc_vdet_field
{
        uint8_t RESERVED0  : 7;
  __IO  uint8_t PON        : 1;
} stc_rtc_vdet_field_t;

typedef struct stc_rtc_hibrst_field
{
  __IO  uint8_t HIBRST     : 1;
} stc_rtc_hibrst_field_t;

typedef struct stc_rtc_vbpfr_field
{
  __IO  uint8_t VPFR0      : 1;
  __IO  uint8_t VPFR1      : 1;
  __IO  uint8_t VPFR2      : 1;
  __IO  uint8_t VPFR3      : 1;
  __IO  uint8_t SPSR0      : 1;
  __IO  uint8_t SPSR1      : 1;
} stc_rtc_vbpfr_field_t;

typedef struct stc_rtc_vbpcr_field
{
  __IO  uint8_t VPCR0      : 1;
  __IO  uint8_t VPCR1      : 1;
  __IO  uint8_t VPCR2      : 1;
  __IO  uint8_t VPCR3      : 1;
} stc_rtc_vbpcr_field_t;

typedef struct stc_rtc_vbddr_field
{
  __IO  uint8_t VDDR0      : 1;
  __IO  uint8_t VDDR1      : 1;
  __IO  uint8_t VDDR2      : 1;
  __IO  uint8_t VDDR3      : 1;
} stc_rtc_vbddr_field_t;

typedef struct stc_rtc_vbdir_field
{
  __IO  uint8_t VDIR0      : 1;
  __IO  uint8_t VDIR1      : 1;
  __IO  uint8_t VDIR2      : 1;
  __IO  uint8_t VDIR3      : 1;
} stc_rtc_vbdir_field_t;

typedef struct stc_rtc_vbdor_field
{
  __IO  uint8_t VDOR0      : 1;
  __IO  uint8_t VDOR1      : 1;
  __IO  uint8_t VDOR2      : 1;
  __IO  uint8_t VDOR3      : 1;
} stc_rtc_vbdor_field_t;

typedef struct stc_rtc_vbpzr_field
{
  __IO  uint8_t VPZR0      : 1;
  __IO  uint8_t VPZR1      : 1;
} stc_rtc_vbpzr_field_t;

/******************************************************************************
 * LCR_MODULE
 ******************************************************************************/
/* LCR_MODULE register bit fields */
typedef struct stc_lcr_lcr_prsld_field
{
  __IO  uint8_t LCR_PRSLD  : 6;
} stc_lcr_lcr_prsld_field_t;

/******************************************************************************
 * CLK_GATING_MODULE
 ******************************************************************************/
/* CLK_GATING_MODULE register bit fields */
typedef struct stc_clk_gating_cken0_field
{
  __IO uint32_t MFSCK0     : 1;
  __IO uint32_t MFSCK1     : 1;
  __IO uint32_t MFSCK2     : 1;
  __IO uint32_t MFSCK3     : 1;
  __IO uint32_t MFSCK4     : 1;
  __IO uint32_t MFSCK5     : 1;
  __IO uint32_t MFSCK6     : 1;
  __IO uint32_t MFSCK7     : 1;
  __IO uint32_t MFSCK8     : 1;
  __IO uint32_t MFSCK9     : 1;
  __IO uint32_t MFSCK10    : 1;
  __IO uint32_t MFSCK11    : 1;
  __IO uint32_t MFSCK12    : 1;
  __IO uint32_t MFSCK13    : 1;
  __IO uint32_t MFSCK14    : 1;
  __IO uint32_t MFSCK15    : 1;
  __IO uint32_t ADCCK0     : 1;
  __IO uint32_t ADCCK1     : 1;
  __IO uint32_t ADCCK2     : 1;
  __IO uint32_t ADCCK3     : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t DMACK      : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t EXBCK      : 1;
       uint32_t RESERVED3  : 1;
  __IO uint32_t GIOCK      : 1;
} stc_clk_gating_cken0_field_t;

typedef struct stc_clk_gating_mrst0_field
{
  __IO uint32_t MFSRST0    : 1;
  __IO uint32_t MFSRST1    : 1;
  __IO uint32_t MFSRST2    : 1;
  __IO uint32_t MFSRST3    : 1;
  __IO uint32_t MFSRST4    : 1;
  __IO uint32_t MFSRST5    : 1;
  __IO uint32_t MFSRST6    : 1;
  __IO uint32_t MFSRST7    : 1;
  __IO uint32_t MFSRST8    : 1;
  __IO uint32_t MFSRST9    : 1;
  __IO uint32_t MFSRST10   : 1;
  __IO uint32_t MFSRST11   : 1;
  __IO uint32_t MFSRST12   : 1;
  __IO uint32_t MFSRST13   : 1;
  __IO uint32_t MFSRST14   : 1;
  __IO uint32_t MFSRST15   : 1;
  __IO uint32_t ADCRST0    : 1;
  __IO uint32_t ADCRST1    : 1;
  __IO uint32_t ADCRST2    : 1;
  __IO uint32_t ADCRST3    : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t DMARST     : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t EXBRST     : 1;
} stc_clk_gating_mrst0_field_t;

typedef struct stc_clk_gating_cken1_field
{
  __IO uint32_t BTMCK0     : 1;
  __IO uint32_t BTMCK1     : 1;
  __IO uint32_t BTMCK2     : 1;
  __IO uint32_t BTMCK3     : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t MFTCK0     : 1;
  __IO uint32_t MFTCK1     : 1;
  __IO uint32_t MFTCK2     : 1;
  __IO uint32_t MFTCK3     : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t QDUCK0     : 1;
  __IO uint32_t QDUCK1     : 1;
  __IO uint32_t QDUCK2     : 1;
  __IO uint32_t QDUCK3     : 1;
} stc_clk_gating_cken1_field_t;

typedef struct stc_clk_gating_mrst1_field
{
  __IO uint32_t BTMRST0    : 1;
  __IO uint32_t BTMRST1    : 1;
  __IO uint32_t BTMRST2    : 1;
  __IO uint32_t BTMRST3    : 1;
       uint32_t RESERVED1  : 4;
  __IO uint32_t MFTRST0    : 1;
  __IO uint32_t MFTRST1    : 1;
  __IO uint32_t MFTRST2    : 1;
  __IO uint32_t MFTRST3    : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t QDURST0    : 1;
  __IO uint32_t QDURST1    : 1;
  __IO uint32_t QDURST2    : 1;
  __IO uint32_t QDURST3    : 1;
} stc_clk_gating_mrst1_field_t;

