MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
typedef struct stc_ethernet_mac_rgsr_field
{
  __IO uint32_t LM         : 1;
  __IO uint32_t LSP        : 2;
  __IO uint32_t LS         : 1;
} stc_ethernet_mac_rgsr_field_t;

typedef struct stc_ethernet_mac_tscr_field
{
  __IO uint32_t TSE        : 1;
  __IO uint32_t TFCU       : 1;
  __IO uint32_t TSI        : 1;
  __IO uint32_t TSU        : 1;
  __IO uint32_t TITE       : 1;
  __IO uint32_t TARU       : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TSEA       : 1;
  __IO uint32_t TSDB       : 1;
  __IO uint32_t TSV2E      : 1;
  __IO uint32_t TETSP      : 1;
  __IO uint32_t TSIP6E     : 1;
  __IO uint32_t TSIP4E     : 1;
  __IO uint32_t TETSEM     : 1;
  __IO uint32_t TSMRM      : 1;
  __IO uint32_t TSPS       : 2;
  __IO uint32_t TSENMF     : 1;
       uint32_t RESERVED2  : 5;
  __IO uint32_t ATSFC      : 1;
} stc_ethernet_mac_tscr_field_t;

typedef struct stc_ethernet_mac_ssir_field
{
  __IO uint32_t SSINC      : 8;
} stc_ethernet_mac_ssir_field_t;

typedef struct stc_ethernet_mac_stsr_field
{
  __IO uint32_t TSS        : 32;
} stc_ethernet_mac_stsr_field_t;

typedef struct stc_ethernet_mac_stnr_field
{
  __IO uint32_t TSSS       : 31;
} stc_ethernet_mac_stnr_field_t;

typedef struct stc_ethernet_mac_stsur_field
{
  __IO uint32_t TSS        : 32;
} stc_ethernet_mac_stsur_field_t;

typedef struct stc_ethernet_mac_stnur_field
{
  __IO uint32_t TSSS       : 31;
  __IO uint32_t ADDSUB     : 1;
} stc_ethernet_mac_stnur_field_t;

typedef struct stc_ethernet_mac_tsar_field
{
  __IO uint32_t TSAR       : 32;
} stc_ethernet_mac_tsar_field_t;

typedef struct stc_ethernet_mac_ttsr_field
{
  __IO uint32_t TSTR       : 32;
} stc_ethernet_mac_ttsr_field_t;

typedef struct stc_ethernet_mac_ttnr_field
{
  __IO uint32_t TSTR       : 31;
} stc_ethernet_mac_ttnr_field_t;

typedef struct stc_ethernet_mac_sthwsr_field
{
  __IO uint32_t TSHWR      : 16;
} stc_ethernet_mac_sthwsr_field_t;

typedef struct stc_ethernet_mac_tsr_field
{
  __IO uint32_t TSSOVF     : 1;
  __IO uint32_t TSTART     : 1;
  __IO uint32_t ATSTS      : 1;
  __IO uint32_t TRGTER     : 1;
       uint32_t RESERVED1  : 20;
  __IO uint32_t ATSSTM     : 1;
  __IO uint32_t ATSNS      : 3;
} stc_ethernet_mac_tsr_field_t;

typedef struct stc_ethernet_mac_ppscr_field
{
  __IO uint32_t PPSCTRL    : 4;
} stc_ethernet_mac_ppscr_field_t;

typedef struct stc_ethernet_mac_atnr_field
{
  __IO uint32_t ATN        : 31;
} stc_ethernet_mac_atnr_field_t;

typedef struct stc_ethernet_mac_atsr_field
{
  __IO uint32_t ATS        : 32;
} stc_ethernet_mac_atsr_field_t;

typedef struct stc_ethernet_mac_bmr_field
{
  __IO uint32_t SWR        : 1;
  __IO uint32_t DA         : 1;
  __IO uint32_t DSL        : 5;
  __IO uint32_t ATDS       : 1;
  __IO uint32_t PBL        : 6;
  __IO uint32_t PR         : 2;
  __IO uint32_t FB         : 1;
  __IO uint32_t RPBL       : 6;
  __IO uint32_t USP        : 1;
  __IO uint32_t _8XPBL     : 1;
  __IO uint32_t AAL        : 1;
  __IO uint32_t MB         : 1;
  __IO uint32_t TXPR       : 1;
} stc_ethernet_mac_bmr_field_t;

typedef struct stc_ethernet_mac_tpdr_field
{
  __IO uint32_t TPD        : 32;
} stc_ethernet_mac_tpdr_field_t;

typedef struct stc_ethernet_mac_rpdr_field
{
  __IO uint32_t RPD        : 32;
} stc_ethernet_mac_rpdr_field_t;

typedef struct stc_ethernet_mac_rdlar_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t SRL        : 30;
} stc_ethernet_mac_rdlar_field_t;

typedef struct stc_ethernet_mac_tdlar_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t STL        : 30;
} stc_ethernet_mac_tdlar_field_t;

typedef struct stc_ethernet_mac_sr_field
{
  __IO uint32_t TI         : 1;
  __IO uint32_t TPS        : 1;
  __IO uint32_t TU         : 1;
  __IO uint32_t TJT        : 1;
  __IO uint32_t OVF        : 1;
  __IO uint32_t UNF        : 1;
  __IO uint32_t RI         : 1;
  __IO uint32_t RU         : 1;
  __IO uint32_t RPS        : 1;
  __IO uint32_t RWT        : 1;
  __IO uint32_t ETI        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FBI        : 1;
  __IO uint32_t ERI        : 1;
  __IO uint32_t AIS        : 1;
  __IO uint32_t NIS        : 1;
  __IO uint32_t RS         : 3;
  __IO uint32_t TS         : 3;
  __IO uint32_t EB         : 3;
  __IO uint32_t GLI        : 1;
  __IO uint32_t GMI        : 1;
  __IO uint32_t GPI        : 1;
  __IO uint32_t TTI        : 1;
  __IO uint32_t GLPII      : 1;
} stc_ethernet_mac_sr_field_t;

typedef struct stc_ethernet_mac_omr_field
{
       uint32_t RESERVED1  : 1;
  __IO uint32_t SR         : 1;
  __IO uint32_t OSF        : 1;
  __IO uint32_t RTC        : 2;
       uint32_t RESERVED2  : 1;
  __IO uint32_t FUF        : 1;
  __IO uint32_t FEF        : 1;
       uint32_t RESERVED3  : 5;
  __IO uint32_t ST         : 1;
  __IO uint32_t TTC        : 3;
       uint32_t RESERVED4  : 3;
  __IO uint32_t FTF        : 1;
  __IO uint32_t TSF        : 1;
       uint32_t RESERVED5  : 2;
  __IO uint32_t DFF        : 1;
  __IO uint32_t RSF        : 1;
  __IO uint32_t DT         : 1;
} stc_ethernet_mac_omr_field_t;

typedef struct stc_ethernet_mac_ier_field
{
  __IO uint32_t TIE        : 1;
  __IO uint32_t TSE        : 1;
  __IO uint32_t TUE        : 1;
  __IO uint32_t TJE        : 1;
  __IO uint32_t OVE        : 1;
  __IO uint32_t UNE        : 1;
  __IO uint32_t RIE        : 1;
  __IO uint32_t RUE        : 1;
  __IO uint32_t RSE        : 1;
  __IO uint32_t RWE        : 1;
  __IO uint32_t ETE        : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t FBE        : 1;
  __IO uint32_t ERE        : 1;
  __IO uint32_t AIE        : 1;
  __IO uint32_t NIE        : 1;
} stc_ethernet_mac_ier_field_t;

typedef struct stc_ethernet_mac_mfbocr_field
{
  __IO uint32_t NMFH       : 16;
  __IO uint32_t ONMFH      : 1;
  __IO uint32_t NMFF       : 11;
  __IO uint32_t ONMFF      : 1;
} stc_ethernet_mac_mfbocr_field_t;

typedef struct stc_ethernet_mac_riwtr_field
{
  __IO uint32_t RIWT       : 8;
} stc_ethernet_mac_riwtr_field_t;

typedef struct stc_ethernet_mac_ahbsr_field
{
  __IO uint32_t AHBS       : 1;
} stc_ethernet_mac_ahbsr_field_t;

typedef struct stc_ethernet_mac_chtdr_field
{
  __IO uint32_t HTDAP      : 32;
} stc_ethernet_mac_chtdr_field_t;

typedef struct stc_ethernet_mac_chrdr_field
{
  __IO uint32_t HRDAP      : 32;
} stc_ethernet_mac_chrdr_field_t;

typedef struct stc_ethernet_mac_chtbar_field
{
  __IO uint32_t HTBAR      : 32;
} stc_ethernet_mac_chtbar_field_t;

