MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
typedef struct stc_canfd_rxf0a_field
{
  __IO uint32_t F0AI       : 6;
} stc_canfd_rxf0a_field_t;

typedef struct stc_canfd_rxbc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t RBSA       : 14;
} stc_canfd_rxbc_field_t;

typedef struct stc_canfd_rxf1c_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t F1SA       : 14;
  __IO uint32_t F1S        : 7;
       uint32_t RESERVED2  : 1;
  __IO uint32_t F1WM       : 7;
  __IO uint32_t F1OM       : 1;
} stc_canfd_rxf1c_field_t;

typedef struct stc_canfd_rxf1s_field
{
  __IO uint32_t F1FL       : 7;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F1GI       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t F1PI       : 6;
       uint32_t RESERVED3  : 2;
  __IO uint32_t F1F        : 1;
  __IO uint32_t RF1L       : 1;
       uint32_t RESERVED4  : 4;
  __IO uint32_t DMS        : 2;
} stc_canfd_rxf1s_field_t;

typedef struct stc_canfd_rxf1a_field
{
  __IO uint32_t F1AI       : 6;
} stc_canfd_rxf1a_field_t;

typedef struct stc_canfd_rxesc_field
{
  __IO uint32_t F0DS       : 3;
       uint32_t RESERVED1  : 1;
  __IO uint32_t F1DS       : 3;
       uint32_t RESERVED2  : 1;
  __IO uint32_t RBDS       : 3;
} stc_canfd_rxesc_field_t;

typedef struct stc_canfd_txbc_field
{
       uint32_t RESERVED1  : 2;
  __IO uint32_t TBSA       : 14;
  __IO uint32_t NDTB       : 6;
       uint32_t RESERVED2  : 2;
  __IO uint32_t TFQS       : 6;
  __IO uint32_t TFQM       : 1;
} stc_canfd_txbc_field_t;

typedef struct stc_canfd_txfqs_field
{
  __IO uint32_t TFFL       : 6;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TFGI       : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t TFQPI      : 5;
  __IO uint32_t TFQF       : 1;
} stc_canfd_txfqs_field_t;

typedef struct stc_canfd_txesc_field
{
  __IO uint32_t TBDS       : 3;
} stc_canfd_txesc_field_t;

typedef struct stc_canfd_txbrp_field
{
  __IO uint32_t TRP0       : 1;
  __IO uint32_t TRP1       : 1;
  __IO uint32_t TRP2       : 1;
  __IO uint32_t TRP3       : 1;
  __IO uint32_t TRP4       : 1;
  __IO uint32_t TRP5       : 1;
  __IO uint32_t TRP6       : 1;
  __IO uint32_t TRP7       : 1;
  __IO uint32_t TRP8       : 1;
  __IO uint32_t TRP9       : 1;
  __IO uint32_t TRP10      : 1;
  __IO uint32_t TRP11      : 1;
  __IO uint32_t TRP12      : 1;
  __IO uint32_t TRP13      : 1;
  __IO uint32_t TRP14      : 1;
  __IO uint32_t TRP15      : 1;
  __IO uint32_t TRP16      : 1;
  __IO uint32_t TRP17      : 1;
  __IO uint32_t TRP18      : 1;
  __IO uint32_t TRP19      : 1;
  __IO uint32_t TRP20      : 1;
  __IO uint32_t TRP21      : 1;
  __IO uint32_t TRP22      : 1;
  __IO uint32_t TRP23      : 1;
  __IO uint32_t TRP24      : 1;
  __IO uint32_t TRP25      : 1;
  __IO uint32_t TRP26      : 1;
  __IO uint32_t TRP27      : 1;
  __IO uint32_t TRP28      : 1;
  __IO uint32_t TRP29      : 1;
  __IO uint32_t TRP30      : 1;
  __IO uint32_t TRP31      : 1;
} stc_canfd_txbrp_field_t;

typedef struct stc_canfd_txbar_field
{
  __IO uint32_t AR0        : 1;
  __IO uint32_t AR1        : 1;
  __IO uint32_t AR2        : 1;
  __IO uint32_t AR3        : 1;
  __IO uint32_t AR4        : 1;
  __IO uint32_t AR5        : 1;
  __IO uint32_t AR6        : 1;
  __IO uint32_t AR7        : 1;
  __IO uint32_t AR8        : 1;
  __IO uint32_t AR9        : 1;
  __IO uint32_t AR10       : 1;
  __IO uint32_t AR11       : 1;
  __IO uint32_t AR12       : 1;
  __IO uint32_t AR13       : 1;
  __IO uint32_t AR14       : 1;
  __IO uint32_t AR15       : 1;
  __IO uint32_t AR16       : 1;
  __IO uint32_t AR17       : 1;
  __IO uint32_t AR18       : 1;
  __IO uint32_t AR19       : 1;
  __IO uint32_t AR20       : 1;
  __IO uint32_t AR21       : 1;
  __IO uint32_t AR22       : 1;
  __IO uint32_t AR23       : 1;
  __IO uint32_t AR24       : 1;
  __IO uint32_t AR25       : 1;
  __IO uint32_t AR26       : 1;
  __IO uint32_t AR27       : 1;
  __IO uint32_t AR28       : 1;
  __IO uint32_t AR29       : 1;
  __IO uint32_t AR30       : 1;
  __IO uint32_t AR31       : 1;
} stc_canfd_txbar_field_t;

typedef struct stc_canfd_txbcr_field
{
  __IO uint32_t CR0        : 1;
  __IO uint32_t CR1        : 1;
  __IO uint32_t CR2        : 1;
  __IO uint32_t CR3        : 1;
  __IO uint32_t CR4        : 1;
  __IO uint32_t CR5        : 1;
  __IO uint32_t CR6        : 1;
  __IO uint32_t CR7        : 1;
  __IO uint32_t CR8        : 1;
  __IO uint32_t CR9        : 1;
  __IO uint32_t CR10       : 1;
  __IO uint32_t CR11       : 1;
  __IO uint32_t CR12       : 1;
  __IO uint32_t CR13       : 1;
  __IO uint32_t CR14       : 1;
  __IO uint32_t CR15       : 1;
  __IO uint32_t CR16       : 1;
  __IO uint32_t CR17       : 1;
  __IO uint32_t CR18       : 1;
  __IO uint32_t CR19       : 1;
  __IO uint32_t CR20       : 1;
  __IO uint32_t CR21       : 1;
  __IO uint32_t CR22       : 1;
  __IO uint32_t CR23       : 1;
  __IO uint32_t CR24       : 1;
  __IO uint32_t CR25       : 1;
  __IO uint32_t CR26       : 1;
  __IO uint32_t CR27       : 1;
  __IO uint32_t CR28       : 1;
  __IO uint32_t CR29       : 1;
  __IO uint32_t CR30       : 1;
  __IO uint32_t CR31       : 1;
} stc_canfd_txbcr_field_t;

typedef struct stc_canfd_txbto_field
{
  __IO uint32_t TO0        : 1;
  __IO uint32_t TO1        : 1;
  __IO uint32_t TO2        : 1;
  __IO uint32_t TO3        : 1;
  __IO uint32_t TO4        : 1;
  __IO uint32_t TO5        : 1;
  __IO uint32_t TO6        : 1;
  __IO uint32_t TO7        : 1;
  __IO uint32_t TO8        : 1;
  __IO uint32_t TO9        : 1;
  __IO uint32_t TO10       : 1;
  __IO uint32_t TO11       : 1;
  __IO uint32_t TO12       : 1;
  __IO uint32_t TO13       : 1;
  __IO uint32_t TO14       : 1;
  __IO uint32_t TO15       : 1;
  __IO uint32_t TO16       : 1;
  __IO uint32_t TO17       : 1;
  __IO uint32_t TO18       : 1;
  __IO uint32_t TO19       : 1;
  __IO uint32_t TO20       : 1;
  __IO uint32_t TO21       : 1;
  __IO uint32_t TO22       : 1;
  __IO uint32_t TO23       : 1;
  __IO uint32_t TO24       : 1;
  __IO uint32_t TO25       : 1;
  __IO uint32_t TO26       : 1;
  __IO uint32_t TO27       : 1;
  __IO uint32_t TO28       : 1;
  __IO uint32_t TO29       : 1;
  __IO uint32_t TO30       : 1;
  __IO uint32_t TO31       : 1;
} stc_canfd_txbto_field_t;

