MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/******************************************************************************
 * DUALFLASH_IF_MODULE
 ******************************************************************************/
/* DUALFLASH_IF registers */
typedef struct
{
  union {
    __IO uint32_t DFASZR;
    stc_dualflash_if_dfaszr_field_t DFASZR_f;
  };
  union {
    __IO uint32_t DFRWTR;
    stc_dualflash_if_dfrwtr_field_t DFRWTR_f;
  };
  union {
    __IO uint32_t DFSTR;
    stc_dualflash_if_dfstr_field_t DFSTR_f;
  };
}FM4_DUALFLASH_IF_TypeDef;

/******************************************************************************
 * UNIQUE_ID_MODULE
 ******************************************************************************/
/* Unique ID registers */
typedef struct
{
  union {
    __IO uint32_t UIDR0;
    stc_unique_id_uidr0_field_t UIDR0_f;
  };
  union {
    __IO uint32_t UIDR1;
    stc_unique_id_uidr1_field_t UIDR1_f;
  };
}FM4_UNIQUE_ID_TypeDef;

/******************************************************************************
 * ECC_CAPTURE_MODULE
 ******************************************************************************/
/* ECC Capture address registers */
typedef struct
{
  union {
    __IO uint32_t FERRAD;
    stc_ecc_capture_ferrad_field_t FERRAD_f;
  };
}FM4_ECC_CAPTURE_TypeDef;

/******************************************************************************
 * Clock_Reset_MODULE
 ******************************************************************************/
/* Clock and reset registers */
typedef struct
{
  union {
    __IO uint32_t SCM_CTL;
    stc_crg_scm_ctl_field_t SCM_CTL_f;
  };
  union {
    __IO uint32_t SCM_STR;
    stc_crg_scm_str_field_t SCM_STR_f;
  };
  __IO uint32_t STB_CTL;
  union {
    __IO uint32_t RST_STR;
    stc_crg_rst_str_field_t RST_STR_f;
  };
  union {
    __IO uint32_t BSC_PSR;
    stc_crg_bsc_psr_field_t BSC_PSR_f;
  };
  union {
    __IO uint32_t APBC0_PSR;
    stc_crg_apbc0_psr_field_t APBC0_PSR_f;
  };
  union {
    __IO uint32_t APBC1_PSR;
    stc_crg_apbc1_psr_field_t APBC1_PSR_f;
  };
  union {
    __IO uint32_t APBC2_PSR;
    stc_crg_apbc2_psr_field_t APBC2_PSR_f;
  };
  union {
    __IO uint32_t SWC_PSR;
    stc_crg_swc_psr_field_t SWC_PSR_f;
  };
        uint8_t RESERVED7[4];
  union {
    __IO uint32_t TTC_PSR;
    stc_crg_ttc_psr_field_t TTC_PSR_f;
  };
        uint8_t RESERVED8[4];
  union {
    __IO uint32_t CSW_TMR;
    stc_crg_csw_tmr_field_t CSW_TMR_f;
  };
  union {
    __IO uint32_t PSW_TMR;
    stc_crg_psw_tmr_field_t PSW_TMR_f;
  };
  union {
    __IO uint32_t PLL_CTL1;
    stc_crg_pll_ctl1_field_t PLL_CTL1_f;
  };
  union {
    __IO uint32_t PLL_CTL2;
    stc_crg_pll_ctl2_field_t PLL_CTL2_f;
  };
  union {
    __IO uint32_t CSV_CTL;
    stc_crg_csv_ctl_field_t CSV_CTL_f;
  };
  union {
    __IO uint32_t CSV_STR;
    stc_crg_csv_str_field_t CSV_STR_f;
  };
  __IO uint32_t FCSWH_CTL;
  __IO uint32_t FCSWL_CTL;
  __IO uint32_t FCSWD_CTL;
  union {
    __IO uint32_t DBWDT_CTL;
    stc_crg_dbwdt_ctl_field_t DBWDT_CTL_f;
  };
        uint8_t RESERVED18[8];
  union {
    __IO uint32_t INT_ENR;
    stc_crg_int_enr_field_t INT_ENR_f;
  };
  union {
    __IO uint32_t INT_STR;
    stc_crg_int_str_field_t INT_STR_f;
  };
  union {
    __IO  uint8_t INT_CLR;
    stc_crg_int_clr_field_t INT_CLR_f;
  };
}FM4_CRG_TypeDef;

/******************************************************************************
 * HWWDT_MODULE
 ******************************************************************************/
/* Hardware watchdog registers */
typedef struct
{
  __IO uint32_t WDG_LDR;
  __IO uint32_t WDG_VLR;
  union {
    __IO uint32_t WDG_CTL;
    stc_hwwdt_wdg_ctl_field_t WDG_CTL_f;
  };
  __IO uint32_t WDG_ICL;
  union {
    __IO uint32_t WDG_RIS;
    stc_hwwdt_wdg_ris_field_t WDG_RIS_f;
  };
        uint8_t RESERVED2[3052];
  __IO uint32_t WDG_LCK;
}FM4_HWWDT_TypeDef;

/******************************************************************************
 * SWWDT_MODULE
 ******************************************************************************/
/* Software watchdog registers */
typedef struct
{
  __IO uint32_t WDOGLOAD;
  __IO uint32_t WDOGVALUE;
  union {
    __IO uint32_t                 WDOGCONTROL;
    stc_swwdt_wdogcontrol_field_t WDOGCONTROL_f;
  };
  __IO uint32_t WDOGINTCLR;
  union {
    __IO uint32_t             WDOGRIS;
    stc_swwdt_wdogris_field_t WDOGRIS_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t              WDOGSPMC;
    stc_swwdt_wdogspmc_field_t WDOGSPMC_f;
  };
        uint8_t RESERVED2[3044];
  __IO uint32_t WDOGLOCK;
}FM4_SWWDT_TypeDef;

/******************************************************************************
 * DTIM_MODULE
 ******************************************************************************/
/* Dual timer 1/2 registers */
typedef struct
{
  __IO uint32_t TIMERXLOAD;
  __IO uint32_t TIMERXVALUE;
  union {
    __IO uint32_t                  TIMERXCONTROL;
    stc_dtim_timerXcontrol_field_t TIMERXCONTROL_f;
  };
  __IO uint32_t TIMERXINTCLR;
  union {
    __IO uint32_t              TIMERXRIS;
    stc_dtim_timerXris_field_t TIMERXRIS_f;
  };
  union {
    __IO uint32_t              TIMERXMIS;
    stc_dtim_timerXmis_field_t TIMERXMIS_f;
  };
  __IO uint32_t TIMERXBGLOAD;
        uint8_t RESERVED0[4];
}FM4_DTIM_TypeDef;

/******************************************************************************
 * MFT_FRT_MODULE
 ******************************************************************************/
/* Multifunction Timer unit 0 Free Running Timer registers */
typedef struct
{
        uint8_t RESERVED0[66];
  __IO uint16_t TCCP0;
        uint8_t RESERVED1[2];
  __IO uint16_t TCDT0;
  union {
    __IO uint16_t TCSA0;
    stc_mft_frt_tcsa0_field_t TCSA0_f;
  };
  union {
    __IO uint16_t TCSC0;
    stc_mft_frt_tcsc0_field_t TCSC0_f;
  };
        uint8_t RESERVED2[2];
  __IO uint16_t TCCP1;
        uint8_t RESERVED3[2];
  __IO uint16_t TCDT1;
  union {
    __IO uint16_t TCSA1;
    stc_mft_frt_tcsa1_field_t TCSA1_f;
  };
  union {
    __IO uint16_t TCSC1;
    stc_mft_frt_tcsc1_field_t TCSC1_f;
  };
        uint8_t RESERVED4[2];
  __IO uint16_t TCCP2;
        uint8_t RESERVED5[2];
  __IO uint16_t TCDT2;
  union {
    __IO uint16_t TCSA2;
    stc_mft_frt_tcsa2_field_t TCSA2_f;
  };
  union {
    __IO uint16_t TCSC2;
    stc_mft_frt_tcsc2_field_t TCSC2_f;
  };
  union {
    __IO uint32_t TCAL;
    stc_mft_frt_tcal_field_t TCAL_f;
  };
        uint8_t RESERVED6[132];
  union {
    __IO uint32_t TCSD;
    stc_mft_frt_tcsd_field_t TCSD_f;
  };
}FM4_MFT_FRT_TypeDef;

