MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/******************************************************************************
 * ETHERNET_CONTROL_MODULE
 ******************************************************************************/
/* ETHERNET_CONTROL registers */
typedef struct
{
  union {
    __IO uint32_t ETH_MODE;
    stc_ethernet_control_eth_mode_field_t ETH_MODE_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t ETH_CLKG;
    stc_ethernet_control_eth_clkg_field_t ETH_CLKG_f;
  };
}FM4_ETHERNET_CONTROL_TypeDef;

/******************************************************************************
 * I2S_MODULE
 ******************************************************************************/
/* I2S registers */
typedef struct
{
  union {
    __IO uint32_t RXFDAT;
    stc_i2s_rxfdat_field_t RXFDAT_f;
  };
  union {
    __IO uint32_t TXFDAT;
    stc_i2s_txfdat_field_t TXFDAT_f;
  };
  union {
    __IO uint32_t CNTREG;
    stc_i2s_cntreg_field_t CNTREG_f;
  };
  union {
    __IO uint32_t MCR0REG;
    stc_i2s_mcr0reg_field_t MCR0REG_f;
  };
  union {
    __IO uint32_t MCR1REG;
    stc_i2s_mcr1reg_field_t MCR1REG_f;
  };
  union {
    __IO uint32_t MCR2REG;
    stc_i2s_mcr2reg_field_t MCR2REG_f;
  };
  union {
    __IO uint32_t OPRREG;
    stc_i2s_oprreg_field_t OPRREG_f;
  };
  union {
    __IO uint32_t SRST;
    stc_i2s_srst_field_t SRST_f;
  };
  union {
    __IO uint32_t INTCNT;
    stc_i2s_intcnt_field_t INTCNT_f;
  };
  union {
    __IO uint32_t STATUS;
    stc_i2s_status_field_t STATUS_f;
  };
  union {
    __IO uint32_t DMAACT;
    stc_i2s_dmaact_field_t DMAACT_f;
  };
  union {
    __IO uint32_t TSTREG;
    stc_i2s_tstreg_field_t TSTREG_f;
  };
}FM4_I2S_TypeDef;

/******************************************************************************
 * SDIF_MODULE
 ******************************************************************************/
/* SD interface registers */
typedef struct
{
  union {
    __IO uint32_t SSA2;
    struct {
      __IO  uint16_t SSALA2;
      __IO  uint16_t SSAHA2;
    };
  };
  union {
    __IO  uint16_t SBSIZE;
    stc_sdif_sbsize_field_t SBSIZE_f;
  };
    __IO  uint16_t SBLCNT;
  union {
    __IO uint32_t SSA1;
    struct {
      __IO  uint16_t SSALA1;
      __IO  uint16_t SSAHA1;
    };
  };
  union {
    __IO  uint16_t STRSFMD;
    stc_sdif_strsfmd_field_t STRSFMD_f;
  };
  union {
    __IO  uint16_t SCMMD;
    stc_sdif_scmmd_field_t SCMMD_f;
  };
    __IO  uint16_t SRESP0;
    __IO  uint16_t SRESP1;
    __IO  uint16_t SRESP2;
    __IO  uint16_t SRESP3;
    __IO  uint16_t SRESP4;
    __IO  uint16_t SRESP5;
    __IO  uint16_t SRESP6;
    __IO  uint16_t SRESP7;
  union {
    __IO uint32_t SBUFDP;
    struct {
      __IO  uint16_t SBUFDP0;
      __IO  uint16_t SBUFDP1;
    };
  };
  union {
    __IO  uint32_t SPRSTAT;
    stc_sdif_sprstat_field_t SPRSTAT_f;
  };
  union {
    __IO  uint8_t SHCTL1;
    stc_sdif_shctl1_field_t SHCTL1_f;
  };
  union {
    __IO  uint8_t SPWRCTL;
    stc_sdif_spwrctl_field_t SPWRCTL_f;
  };
  union {
    __IO  uint8_t SBLKGPCTL;
    stc_sdif_sblkgpctl_field_t SBLKGPCTL_f;
  };
  union {
    __IO  uint8_t SWKUPCTL;
    stc_sdif_swkupctl_field_t SWKUPCTL_f;
  };
  union {
    __IO  uint16_t SCLKCTL;
    stc_sdif_sclkctl_field_t SCLKCTL_f;
  };
  union {
    __IO  uint8_t STOCTL;
    stc_sdif_stoctl_field_t STOCTL_f;
  };
  union {
    __IO  uint8_t SSRST;
    stc_sdif_ssrst_field_t SSRST_f;
  };
  union {
    __IO  uint16_t SNINTST;
    stc_sdif_snintst_field_t SNINTST_f;
  };
  union {
    __IO  uint16_t SEINTST;
    stc_sdif_seintst_field_t SEINTST_f;
  };
  union {
    __IO  uint16_t SNINTSTE;
    stc_sdif_snintste_field_t SNINTSTE_f;
  };
  union {
    __IO  uint16_t SEINTSTE;
    stc_sdif_seintste_field_t SEINTSTE_f;
  };
  union {
    __IO  uint16_t SNINTSGE;
    stc_sdif_snintsge_field_t SNINTSGE_f;
  };
  union {
    __IO  uint16_t SEINTSGE;
    stc_sdif_seintsge_field_t SEINTSGE_f;
  };
  union {
    __IO  uint16_t SACMDEST;
    stc_sdif_sacmdest_field_t SACMDEST_f;
  };
  union {
    __IO  uint16_t SHCTL2;
    stc_sdif_shctl2_field_t SHCTL2_f;
  };
  union {
    __IO  uint16_t CAPBLTY0;
    stc_sdif_capblty0_field_t CAPBLTY0_f;
  };
  union {
    __IO  uint16_t CAPBLTY1;
    stc_sdif_capblty1_field_t CAPBLTY1_f;
  };
  union {
    __IO  uint16_t CAPBLTY2;
    stc_sdif_capblty2_field_t CAPBLTY2_f;
  };
  union {
    __IO  uint16_t CAPBLTY3;
    stc_sdif_capblty3_field_t CAPBLTY3_f;
  };
  union {
    __IO  uint16_t MXCCAPY0;
    stc_sdif_mxccapy0_field_t MXCCAPY0_f;
  };
  union {
    __IO  uint16_t MXCCAPY1;
    stc_sdif_mxccapy1_field_t MXCCAPY1_f;
  };
  union {
    __IO  uint16_t MXCCAPY2;
    stc_sdif_mxccapy2_field_t MXCCAPY2_f;
  };
  union {
    __IO  uint16_t MXCCAPY3;
    stc_sdif_mxccapy3_field_t MXCCAPY3_f;
  };
  union {
    __IO  uint16_t FEACEST;
    stc_sdif_feacest_field_t FEACEST_f;
  };
  union {
    __IO  uint16_t SFEEIST;
    stc_sdif_sfeeist_field_t SFEEIST_f;
  };
  union {
    __IO  uint8_t ADMAEST;
    stc_sdif_admaest_field_t ADMAEST_f;
  };
        uint8_t RESERVED0[3];
  union {
    __IO  uint16_t SADSA0;
    stc_sdif_sadsa0_field_t SADSA0_f;
  };
  union {
    __IO  uint16_t SADSA1;
    stc_sdif_sadsa1_field_t SADSA1_f;
  };
  union {
    __IO  uint16_t SADSA2;
    stc_sdif_sadsa2_field_t SADSA2_f;
  };
  union {
    __IO  uint16_t SADSA3;
    stc_sdif_sadsa3_field_t SADSA3_f;
  };
  union {
    __IO  uint16_t SPRVAL0;
    stc_sdif_sprval0_field_t SPRVAL0_f;
  };
  union {
    __IO  uint16_t SPRVAL1;
    stc_sdif_sprval1_field_t SPRVAL1_f;
  };
  union {
    __IO  uint16_t SPRVAL2;
    stc_sdif_sprval2_field_t SPRVAL2_f;
  };
  union {
    __IO  uint16_t SPRVAL3;
    stc_sdif_sprval3_field_t SPRVAL3_f;
  };
  union {
    __IO  uint16_t SPRVAL4;
    stc_sdif_sprval4_field_t SPRVAL4_f;
  };
  union {
    __IO  uint16_t SPRVAL5;
    stc_sdif_sprval5_field_t SPRVAL5_f;
  };
  union {
    __IO  uint16_t SPRVAL6;
    stc_sdif_sprval6_field_t SPRVAL6_f;
  };
  union {
    __IO  uint16_t SPRVAL7;
    stc_sdif_sprval7_field_t SPRVAL7_f;
  };
        uint8_t RESERVED1[112];
  union {
    __IO  uint16_t SSHBCTLL;
    stc_sdif_sshbctll_field_t SSHBCTLL_f;
  };
  union {
    __IO  uint16_t SSHBCTLH;
    stc_sdif_sshbctlh_field_t SSHBCTLH_f;
  };
        uint8_t RESERVED2[24];
  union {
    __IO  uint16_t SSLIST;
    stc_sdif_sslist_field_t SSLIST_f;
  };
  union {
    __IO  uint16_t SHCTLV;
    stc_sdif_shctlv_field_t SHCTLV_f;
  };
  union {
    __IO  uint16_t AHBCFGL;
    stc_sdif_ahbcfgl_field_t AHBCFGL_f;
  };
  union {
    __IO  uint16_t AHBCFGH;
    stc_sdif_ahbcfgh_field_t AHBCFGH_f;
  };
  union {
    __IO  uint16_t SPWSWCL;
    stc_sdif_spwswcl_field_t SPWSWCL_f;
  };
  union {
    __IO  uint16_t SPWSWCH;
    stc_sdif_spwswch_field_t SPWSWCH_f;
  };
  union {
    __IO  uint16_t STUNSETL;
    stc_sdif_stunsetl_field_t STUNSETL_f;
  };
  union {
    __IO  uint16_t STUNSETH;
    stc_sdif_stunseth_field_t STUNSETH_f;
  };
  union {
    __IO  uint16_t STUNSTL;
    stc_sdif_stunstl_field_t STUNSTL_f;
  };
  union {
    __IO  uint16_t STUNSTH;
    stc_sdif_stunsth_field_t STUNSTH_f;
  };
        uint8_t RESERVED3[4];
  __IO  uint16_t SIOCTL2L;
  __IO  uint16_t SIOCTL2H;
  union {
    __IO  uint16_t PSWISTL;
    stc_sdif_pswistl_field_t PSWISTL_f;
  };
  union {
    __IO  uint16_t PSWISTH;
    stc_sdif_pswisth_field_t PSWISTH_f;
  };
  union {
    __IO  uint16_t PSWISTEL;
    stc_sdif_pswistel_field_t PSWISTEL_f;
  };
  union {
    __IO  uint16_t PSWISTEH;
    stc_sdif_pswisteh_field_t PSWISTEH_f;
  };
  union {
    __IO  uint16_t PSWISGEL;
    stc_sdif_pswisgel_field_t PSWISGEL_f;
  };
  union {
    __IO  uint16_t PSWISGEH;
    stc_sdif_pswisgeh_field_t PSWISGEH_f;
  };
  union {
    __IO  uint16_t MMCSDCL;
    stc_sdif_mmcsdcl_field_t MMCSDCL_f;
  };
  union {
    __IO  uint16_t MMCSDCH;
    stc_sdif_mmcsdch_field_t MMCSDCH_f;
  };
  union {
    __IO  uint16_t MCWIRQC0;
    stc_sdif_mcwirqc0_field_t MCWIRQC0_f;
  };
  union {
    __IO  uint16_t MCWIRQC1;
    stc_sdif_mcwirqc1_field_t MCWIRQC1_f;
  };
  union {
    __IO  uint16_t MCWIRQC2;
    stc_sdif_mcwirqc2_field_t MCWIRQC2_f;
  };
  union {
    __IO  uint16_t MCWIRQC3;
    stc_sdif_mcwirqc3_field_t MCWIRQC3_f;
  };
  union {
    __IO  uint16_t MCRPCKBL;
    stc_sdif_mcrpckbl_field_t MCRPCKBL_f;
  };
  union {
    __IO  uint16_t MCRPCKBH;
    stc_sdif_mcrpckbh_field_t MCRPCKBH_f;
  };
        uint8_t RESERVED4[32];
  union {
    __IO  uint16_t SCDETECS;
    stc_sdif_scdetecs_field_t SCDETECS_f;
  };
        uint8_t RESERVED5[2];
}FM4_SDIF_TypeDef;

