MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/******************************************************************************
 * CANFD_MODULE
 ******************************************************************************/
/* CANFD registers */
typedef struct
{
  union {
    __IO uint32_t CREL;
    stc_canfd_crel_field_t CREL_f;
  };
  union {
    __IO uint32_t ENDN;
    stc_canfd_endn_field_t ENDN_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t FBTP;
    stc_canfd_fbtp_field_t FBTP_f;
  };
  union {
    __IO uint32_t TEST;
    stc_canfd_test_field_t TEST_f;
  };
  union {
    __IO uint32_t RWD;
    stc_canfd_rwd_field_t RWD_f;
  };
  union {
    __IO uint32_t CCCR;
    stc_canfd_cccr_field_t CCCR_f;
  };
  union {
    __IO uint32_t BTP;
    stc_canfd_btp_field_t BTP_f;
  };
  union {
    __IO uint32_t TSCC;
    stc_canfd_tscc_field_t TSCC_f;
  };
  union {
    __IO uint32_t TSCV;
    stc_canfd_tscv_field_t TSCV_f;
  };
  union {
    __IO uint32_t TOCC;
    stc_canfd_tocc_field_t TOCC_f;
  };
  union {
    __IO uint32_t TOCV;
    stc_canfd_tocv_field_t TOCV_f;
  };
        uint8_t RESERVED2[16];
  union {
    __IO uint32_t ECR;
    stc_canfd_ecr_field_t ECR_f;
  };
  union {
    __IO uint32_t PSR;
    stc_canfd_psr_field_t PSR_f;
  };
        uint8_t RESERVED3[8];
  union {
    __IO uint32_t IR;
    stc_canfd_ir_field_t IR_f;
  };
  union {
    __IO uint32_t IE;
    stc_canfd_ie_field_t IE_f;
  };
  union {
    __IO uint32_t ILS;
    stc_canfd_ils_field_t ILS_f;
  };
  union {
    __IO uint32_t ILE;
    stc_canfd_ile_field_t ILE_f;
  };
        uint8_t RESERVED4[32];
  union {
    __IO uint32_t GFC;
    stc_canfd_gfc_field_t GFC_f;
  };
  union {
    __IO uint32_t SIDFC;
    stc_canfd_sidfc_field_t SIDFC_f;
  };
  union {
    __IO uint32_t XIDFC;
    stc_canfd_xidfc_field_t XIDFC_f;
  };
        uint8_t RESERVED5[4];
  union {
    __IO uint32_t XIDAM;
    stc_canfd_xidam_field_t XIDAM_f;
  };
  union {
    __IO uint32_t HPMS;
    stc_canfd_hpms_field_t HPMS_f;
  };
  union {
    __IO uint32_t NDAT1;
    stc_canfd_ndat1_field_t NDAT1_f;
  };
  union {
    __IO uint32_t NDAT2;
    stc_canfd_ndat2_field_t NDAT2_f;
  };
  union {
    __IO uint32_t RXF0C;
    stc_canfd_rxf0c_field_t RXF0C_f;
  };
  union {
    __IO uint32_t RXF0S;
    stc_canfd_rxf0s_field_t RXF0S_f;
  };
  union {
    __IO uint32_t RXF0A;
    stc_canfd_rxf0a_field_t RXF0A_f;
  };
  union {
    __IO uint32_t RXBC;
    stc_canfd_rxbc_field_t RXBC_f;
  };
  union {
    __IO uint32_t RXF1C;
    stc_canfd_rxf1c_field_t RXF1C_f;
  };
  union {
    __IO uint32_t RXF1S;
    stc_canfd_rxf1s_field_t RXF1S_f;
  };
  union {
    __IO uint32_t RXF1A;
    stc_canfd_rxf1a_field_t RXF1A_f;
  };
  union {
    __IO uint32_t RXESC;
    stc_canfd_rxesc_field_t RXESC_f;
  };
  union {
    __IO uint32_t TXBC;
    stc_canfd_txbc_field_t TXBC_f;
  };
  union {
    __IO uint32_t TXFQS;
    stc_canfd_txfqs_field_t TXFQS_f;
  };
  union {
    __IO uint32_t TXESC;
    stc_canfd_txesc_field_t TXESC_f;
  };
  union {
    __IO uint32_t TXBRP;
    stc_canfd_txbrp_field_t TXBRP_f;
  };
  union {
    __IO uint32_t TXBAR;
    stc_canfd_txbar_field_t TXBAR_f;
  };
  union {
    __IO uint32_t TXBCR;
    stc_canfd_txbcr_field_t TXBCR_f;
  };
  union {
    __IO uint32_t TXBTO;
    stc_canfd_txbto_field_t TXBTO_f;
  };
  union {
    __IO uint32_t TXBCF;
    stc_canfd_txbcf_field_t TXBCF_f;
  };
  union {
    __IO uint32_t TXBTIE;
    stc_canfd_txbtie_field_t TXBTIE_f;
  };
  union {
    __IO uint32_t TXBCIE;
    stc_canfd_txbcie_field_t TXBCIE_f;
  };
        uint8_t RESERVED6[8];
  union {
    __IO uint32_t TXEFC;
    stc_canfd_txefc_field_t TXEFC_f;
  };
  union {
    __IO uint32_t TXFS;
    stc_canfd_txfs_field_t TXFS_f;
  };
  union {
    __IO uint32_t TXFA;
    stc_canfd_txfa_field_t TXFA_f;
  };
        uint8_t RESERVED7[260];
  union {
    __IO  uint8_t FDECR;
    stc_canfd_fdecr_field_t FDECR_f;
  };
  union {
    __IO  uint8_t FDESR;
    stc_canfd_fdesr_field_t FDESR_f;
  };
  union {
    __IO uint16_t FDSEAR;
    stc_canfd_fdsear_field_t FDSEAR_f;
  };
        uint8_t RESERVED8[1];
  union {
    __IO  uint8_t FDESCR;
    stc_canfd_fdescr_field_t FDESCR_f;
  };
  union {
    __IO uint16_t FDDEAR;
    stc_canfd_fddear_field_t FDDEAR_f;
  };
        uint8_t RESERVED9[8];
  union {
    __IO uint16_t TSCNTR;
    stc_canfd_tscntr_field_t TSCNTR_f;
  };
  union {
    __IO uint16_t TSMDR;
    stc_canfd_tsmdr_field_t TSMDR_f;
  };
  union {
    __IO uint32_t TSDIVR;
    stc_canfd_tsdivr_field_t TSDIVR_f;
  };
  union {
    __IO uint16_t TSCDTR;
    stc_canfd_tscdtr_field_t TSCDTR_f;
  };
  union {
    __IO uint16_t TSCPCLR;
    stc_canfd_tscpclr_field_t TSCPCLR_f;
  };
}FM4_CANFD_TypeDef;

/******************************************************************************
 * PCRC_MODULE
 ******************************************************************************/
/* PCRC registers */
typedef struct
{
  __IO uint32_t PRGCRC_POLY;
  __IO uint32_t PRGCRC_SEED;
  __IO uint32_t PRGCRC_FXOR;
  union {
    __IO uint32_t PRGCRC_CFG;
    stc_pcrc_prgcrc_cfg_field_t PRGCRC_CFG_f;
  };
  __IO uint32_t PRGCRC_WR;
  __IO uint32_t PRGCRC_RD;
}FM4_PCRC_TypeDef;

/******************************************************************************
 * HSSPI_MODULE
 ******************************************************************************/
/* HSSPI registers */
typedef struct
{
  union {
    __IO uint32_t MCTRL;
    stc_hsspi_mctrl_field_t MCTRL_f;
  };
  union {
    __IO uint32_t PCC0;
    stc_hsspi_pcc0_field_t PCC0_f;
  };
  union {
    __IO uint32_t PCC1;
    stc_hsspi_pcc1_field_t PCC1_f;
  };
  union {
    __IO uint32_t PCC2;
    stc_hsspi_pcc2_field_t PCC2_f;
  };
  union {
    __IO uint32_t PCC3;
    stc_hsspi_pcc3_field_t PCC3_f;
  };
  union {
    __IO uint32_t TXF;
    stc_hsspi_txf_field_t TXF_f;
  };
  union {
    __IO uint32_t TXE;
    stc_hsspi_txe_field_t TXE_f;
  };
  union {
    __IO uint32_t TXC;
    stc_hsspi_txc_field_t TXC_f;
  };
  union {
    __IO uint32_t RXF;
    stc_hsspi_rxf_field_t RXF_f;
  };
  union {
    __IO uint32_t RXE;
    stc_hsspi_rxe_field_t RXE_f;
  };
  union {
    __IO uint32_t RXC;
    stc_hsspi_rxc_field_t RXC_f;
  };
  union {
    __IO uint32_t FAULTF;
    stc_hsspi_faultf_field_t FAULTF_f;
  };
  union {
    __IO uint32_t FAULTC;
    stc_hsspi_faultc_field_t FAULTC_f;
  };
  union {
    __IO  uint8_t DMCFG;
    stc_hsspi_dmcfg_field_t DMCFG_f;
  };
  union {
    __IO  uint8_t DMDMAEN;
    stc_hsspi_dmdmaen_field_t DMDMAEN_f;
  };
        uint8_t RESERVED1[2];
  union {
    __IO  uint8_t DMSTART;
    stc_hsspi_dmstart_field_t DMSTART_f;
  };
  union {
    __IO  uint8_t DMSTOP;
    stc_hsspi_dmstop_field_t DMSTOP_f;
  };
  union {
    __IO  uint8_t DMPSEL;
    stc_hsspi_dmpsel_field_t DMPSEL_f;
  };
  union {
    __IO  uint8_t DMTRP;
    stc_hsspi_dmtrp_field_t DMTRP_f;
  };
  union {
    __IO uint16_t DMBCC;
    stc_hsspi_dmbcc_field_t DMBCC_f;
  };
  union {
    __IO uint16_t DMBCS;
    stc_hsspi_dmbcs_field_t DMBCS_f;
  };
  union {
    __IO uint32_t DMSTATUS;
    stc_hsspi_dmstatus_field_t DMSTATUS_f;
  };
        uint8_t RESERVED2[8];
  union {
    __IO uint32_t FIFOCFG;
    stc_hsspi_fifocfg_field_t FIFOCFG_f;
  };
  union {
    __IO uint32_t TXFIFO0;
    stc_hsspi_txfifo_field_t TXFIFO0_f;
  };
  union {
    __IO uint32_t TXFIFO1;
    stc_hsspi_txfifo_field_t TXFIFO1_f;
  };
  union {
    __IO uint32_t TXFIFO2;
    stc_hsspi_txfifo_field_t TXFIFO2_f;
  };
  union {
    __IO uint32_t TXFIFO3;
    stc_hsspi_txfifo_field_t TXFIFO3_f;
  };
  union {
    __IO uint32_t TXFIFO4;
    stc_hsspi_txfifo_field_t TXFIFO4_f;
  };
  union {
    __IO uint32_t TXFIFO5;
    stc_hsspi_txfifo_field_t TXFIFO5_f;
  };
  union {
    __IO uint32_t TXFIFO6;
    stc_hsspi_txfifo_field_t TXFIFO6_f;
  };
  union {
    __IO uint32_t TXFIFO7;
    stc_hsspi_txfifo_field_t TXFIFO7_f;
  };
  union {
    __IO uint32_t TXFIFO8;
    stc_hsspi_txfifo_field_t TXFIFO8_f;
  };
  union {
    __IO uint32_t TXFIFO9;
    stc_hsspi_txfifo_field_t TXFIFO9_f;
  };
  union {
    __IO uint32_t TXFIFO10;
    stc_hsspi_txfifo_field_t TXFIFO10_f;
  };
  union {
    __IO uint32_t TXFIFO11;
    stc_hsspi_txfifo_field_t TXFIFO11_f;
  };
  union {
    __IO uint32_t TXFIFO12;
    stc_hsspi_txfifo_field_t TXFIFO12_f;
  };
  union {
    __IO uint32_t TXFIFO13;
    stc_hsspi_txfifo_field_t TXFIFO13_f;
  };
  union {
    __IO uint32_t TXFIFO14;
    stc_hsspi_txfifo_field_t TXFIFO14_f;
  };
  union {
    __IO uint32_t TXFIFO15;
    stc_hsspi_txfifo_field_t TXFIFO15_f;
  };
  union {
    __IO uint32_t RXFIFO0;
    stc_hsspi_rxfifo_field_t RXFIFO0_f;
  };
  union {
    __IO uint32_t RXFIFO1;
    stc_hsspi_rxfifo_field_t RXFIFO1_f;
  };
  union {
    __IO uint32_t RXFIFO2;
    stc_hsspi_rxfifo_field_t RXFIFO2_f;
  };
  union {
    __IO uint32_t RXFIFO3;
    stc_hsspi_rxfifo_field_t RXFIFO3_f;
  };
  union {
    __IO uint32_t RXFIFO4;
    stc_hsspi_rxfifo_field_t RXFIFO4_f;
  };
  union {
    __IO uint32_t RXFIFO5;
    stc_hsspi_rxfifo_field_t RXFIFO5_f;
  };
  union {
    __IO uint32_t RXFIFO6;
    stc_hsspi_rxfifo_field_t RXFIFO6_f;
  };
  union {
    __IO uint32_t RXFIFO7;
    stc_hsspi_rxfifo_field_t RXFIFO7_f;
  };
  union {
    __IO uint32_t RXFIFO8;
    stc_hsspi_rxfifo_field_t RXFIFO8_f;
  };
  union {
    __IO uint32_t RXFIFO9;
    stc_hsspi_rxfifo_field_t RXFIFO9_f;
  };
  union {
    __IO uint32_t RXFIFO10;
    stc_hsspi_rxfifo_field_t RXFIFO10_f;
  };
  union {
    __IO uint32_t RXFIFO11;
    stc_hsspi_rxfifo_field_t RXFIFO11_f;
  };
  union {
    __IO uint32_t RXFIFO12;
    stc_hsspi_rxfifo_field_t RXFIFO12_f;
  };
  union {
    __IO uint32_t RXFIFO13;
    stc_hsspi_rxfifo_field_t RXFIFO13_f;
  };
  union {
    __IO uint32_t RXFIFO14;
    stc_hsspi_rxfifo_field_t RXFIFO14_f;
  };
  union {
    __IO uint32_t RXFIFO15;
    stc_hsspi_rxfifo_field_t RXFIFO15_f;
  };
  union {
    __IO uint32_t CSCFG;
    stc_hsspi_cscfg_field_t CSCFG_f;
  };
  union {
    __IO uint32_t CSITIME;
    stc_hsspi_csitime_field_t CSITIME_f;
  };
  union {
    __IO uint32_t CSAEXT;
    stc_hsspi_csaext_field_t CSAEXT_f;
  };
  union {
    __IO uint16_t RDCSDC0;
    stc_hsspi_rdcsdc_field_t RDCSDC0_f;
  };
  union {
    __IO uint16_t RDCSDC1;
    stc_hsspi_rdcsdc_field_t RDCSDC1_f;
  };
  union {
    __IO uint16_t RDCSDC2;
    stc_hsspi_rdcsdc_field_t RDCSDC2_f;
  };
  union {
    __IO uint16_t RDCSDC3;
    stc_hsspi_rdcsdc_field_t RDCSDC3_f;
  };
  union {
    __IO uint16_t RDCSDC4;
    stc_hsspi_rdcsdc_field_t RDCSDC4_f;
  };
  union {
    __IO uint16_t RDCSDC5;
    stc_hsspi_rdcsdc_field_t RDCSDC5_f;
  };
  union {
    __IO uint16_t RDCSDC6;
    stc_hsspi_rdcsdc_field_t RDCSDC6_f;
  };
  union {
    __IO uint16_t RDCSDC7;
    stc_hsspi_rdcsdc_field_t RDCSDC7_f;
  };
  union {
    __IO uint16_t WRCSDC0;
    stc_hsspi_wrcsdc_field_t WRCSDC0_f;
  };
  union {
    __IO uint16_t WRCSDC1;
    stc_hsspi_wrcsdc_field_t WRCSDC1_f;
  };
  union {
    __IO uint16_t WRCSDC2;
    stc_hsspi_wrcsdc_field_t WRCSDC2_f;
  };
  union {
    __IO uint16_t WRCSDC3;
    stc_hsspi_wrcsdc_field_t WRCSDC3_f;
  };
  union {
    __IO uint16_t WRCSDC4;
    stc_hsspi_wrcsdc_field_t WRCSDC4_f;
  };
  union {
    __IO uint16_t WRCSDC5;
    stc_hsspi_wrcsdc_field_t WRCSDC5_f;
  };
  union {
    __IO uint16_t WRCSDC6;
    stc_hsspi_wrcsdc_field_t WRCSDC6_f;
  };
  union {
    __IO uint16_t WRCSDC7;
    stc_hsspi_wrcsdc_field_t WRCSDC7_f;
  };
  union {
    __IO uint32_t MID;
    stc_hsspi_mid_field_t MID_f;
  };
        uint8_t RESERVED3[768];
  union {
    __IO  uint8_t QDCLKR;
    stc_hsspi_qdclkr_field_t QDCLKR_f;
  };
        uint8_t RESERVED4[3];
  union {
    __IO  uint8_t DBCNT;
    stc_hsspi_dbcnt_field_t DBCNT_f;
  };
}FM4_HSSPI_TypeDef;

