MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* Base Timer 7 PWM registers */
#define bFM4_BT7_PWM_TMCR_STRG                 *((volatile unsigned char*)(0x424A5980UL))
#define bFM4_BT7_PWM_TMCR_CTEN                 *((volatile unsigned char*)(0x424A5984UL))
#define bFM4_BT7_PWM_TMCR_MDSE                 *((volatile unsigned char*)(0x424A5988UL))
#define bFM4_BT7_PWM_TMCR_OSEL                 *((volatile unsigned char*)(0x424A598CUL))
#define bFM4_BT7_PWM_TMCR_FMD0                 *((volatile unsigned char*)(0x424A5990UL))
#define bFM4_BT7_PWM_TMCR_FMD1                 *((volatile unsigned char*)(0x424A5994UL))
#define bFM4_BT7_PWM_TMCR_FMD2                 *((volatile unsigned char*)(0x424A5998UL))
#define bFM4_BT7_PWM_TMCR_EGS0                 *((volatile unsigned char*)(0x424A59A0UL))
#define bFM4_BT7_PWM_TMCR_EGS1                 *((volatile unsigned char*)(0x424A59A4UL))
#define bFM4_BT7_PWM_TMCR_PMSK                 *((volatile unsigned char*)(0x424A59A8UL))
#define bFM4_BT7_PWM_TMCR_RTGEN                *((volatile unsigned char*)(0x424A59ACUL))
#define bFM4_BT7_PWM_TMCR_CKS0                 *((volatile unsigned char*)(0x424A59B0UL))
#define bFM4_BT7_PWM_TMCR_CKS1                 *((volatile unsigned char*)(0x424A59B4UL))
#define bFM4_BT7_PWM_TMCR_CKS2                 *((volatile unsigned char*)(0x424A59B8UL))
#define bFM4_BT7_PWM_STC_UDIR                  *((volatile unsigned char*)(0x424A5A00UL))
#define bFM4_BT7_PWM_STC_DTIR                  *((volatile unsigned char*)(0x424A5A04UL))
#define bFM4_BT7_PWM_STC_TGIR                  *((volatile unsigned char*)(0x424A5A08UL))
#define bFM4_BT7_PWM_STC_UDIE                  *((volatile unsigned char*)(0x424A5A10UL))
#define bFM4_BT7_PWM_STC_DTIE                  *((volatile unsigned char*)(0x424A5A14UL))
#define bFM4_BT7_PWM_STC_TGIE                  *((volatile unsigned char*)(0x424A5A18UL))
#define bFM4_BT7_PWM_TMCR2_CKS3                *((volatile unsigned char*)(0x424A5A20UL))

/* Base Timer 7 RT registers */
#define bFM4_BT7_RT_TMCR_STRG                  *((volatile unsigned char*)(0x424A5980UL))
#define bFM4_BT7_RT_TMCR_CTEN                  *((volatile unsigned char*)(0x424A5984UL))
#define bFM4_BT7_RT_TMCR_MDSE                  *((volatile unsigned char*)(0x424A5988UL))
#define bFM4_BT7_RT_TMCR_OSEL                  *((volatile unsigned char*)(0x424A598CUL))
#define bFM4_BT7_RT_TMCR_FMD0                  *((volatile unsigned char*)(0x424A5990UL))
#define bFM4_BT7_RT_TMCR_FMD1                  *((volatile unsigned char*)(0x424A5994UL))
#define bFM4_BT7_RT_TMCR_FMD2                  *((volatile unsigned char*)(0x424A5998UL))
#define bFM4_BT7_RT_TMCR_T32                   *((volatile unsigned char*)(0x424A599CUL))
#define bFM4_BT7_RT_TMCR_EGS0                  *((volatile unsigned char*)(0x424A59A0UL))
#define bFM4_BT7_RT_TMCR_EGS1                  *((volatile unsigned char*)(0x424A59A4UL))
#define bFM4_BT7_RT_TMCR_CKS0                  *((volatile unsigned char*)(0x424A59B0UL))
#define bFM4_BT7_RT_TMCR_CKS1                  *((volatile unsigned char*)(0x424A59B4UL))
#define bFM4_BT7_RT_TMCR_CKS2                  *((volatile unsigned char*)(0x424A59B8UL))
#define bFM4_BT7_RT_STC_UDIR                   *((volatile unsigned char*)(0x424A5A00UL))
#define bFM4_BT7_RT_STC_TGIR                   *((volatile unsigned char*)(0x424A5A08UL))
#define bFM4_BT7_RT_STC_UDIE                   *((volatile unsigned char*)(0x424A5A10UL))
#define bFM4_BT7_RT_STC_TGIE                   *((volatile unsigned char*)(0x424A5A18UL))
#define bFM4_BT7_RT_TMCR2_CKS3                 *((volatile unsigned char*)(0x424A5A20UL))

/* Base Timer 7 PWC registers */
#define bFM4_BT7_PWC_TMCR_CTEN                 *((volatile unsigned char*)(0x424A5984UL))
#define bFM4_BT7_PWC_TMCR_MDSE                 *((volatile unsigned char*)(0x424A5988UL))
#define bFM4_BT7_PWC_TMCR_FMD0                 *((volatile unsigned char*)(0x424A5990UL))
#define bFM4_BT7_PWC_TMCR_FMD1                 *((volatile unsigned char*)(0x424A5994UL))
#define bFM4_BT7_PWC_TMCR_FMD2                 *((volatile unsigned char*)(0x424A5998UL))
#define bFM4_BT7_PWC_TMCR_T32                  *((volatile unsigned char*)(0x424A599CUL))
#define bFM4_BT7_PWC_TMCR_EGS0                 *((volatile unsigned char*)(0x424A59A0UL))
#define bFM4_BT7_PWC_TMCR_EGS1                 *((volatile unsigned char*)(0x424A59A4UL))
#define bFM4_BT7_PWC_TMCR_EGS2                 *((volatile unsigned char*)(0x424A59A8UL))
#define bFM4_BT7_PWC_TMCR_CKS0                 *((volatile unsigned char*)(0x424A59B0UL))
#define bFM4_BT7_PWC_TMCR_CKS1                 *((volatile unsigned char*)(0x424A59B4UL))
#define bFM4_BT7_PWC_TMCR_CKS2                 *((volatile unsigned char*)(0x424A59B8UL))
#define bFM4_BT7_PWC_STC_OVIR                  *((volatile unsigned char*)(0x424A5A00UL))
#define bFM4_BT7_PWC_STC_EDIR                  *((volatile unsigned char*)(0x424A5A08UL))
#define bFM4_BT7_PWC_STC_OVIE                  *((volatile unsigned char*)(0x424A5A10UL))
#define bFM4_BT7_PWC_STC_EDIE                  *((volatile unsigned char*)(0x424A5A18UL))
#define bFM4_BT7_PWC_STC_ERR                   *((volatile unsigned char*)(0x424A5A1CUL))
#define bFM4_BT7_PWC_TMCR2_CKS3                *((volatile unsigned char*)(0x424A5A20UL))

/* Base Timer I/O selector channel 0 - channel 3 registers */
#define bFM4_BTIOSEL03_BTSEL0123_SEL01_0       *((volatile unsigned char*)(0x424A2020UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL01_1       *((volatile unsigned char*)(0x424A2024UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL01_2       *((volatile unsigned char*)(0x424A2028UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL01_3       *((volatile unsigned char*)(0x424A202CUL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL23_0       *((volatile unsigned char*)(0x424A2030UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL23_1       *((volatile unsigned char*)(0x424A2034UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL23_2       *((volatile unsigned char*)(0x424A2038UL))
#define bFM4_BTIOSEL03_BTSEL0123_SEL23_3       *((volatile unsigned char*)(0x424A203CUL))

/* Base Timer I/O selector channel 4 - channel 7 registers */
#define bFM4_BTIOSEL47_BTSEL4567_SEL45_0       *((volatile unsigned char*)(0x424A6020UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL45_1       *((volatile unsigned char*)(0x424A6024UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL45_2       *((volatile unsigned char*)(0x424A6028UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL45_3       *((volatile unsigned char*)(0x424A602CUL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL67_0       *((volatile unsigned char*)(0x424A6030UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL67_1       *((volatile unsigned char*)(0x424A6034UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL67_2       *((volatile unsigned char*)(0x424A6038UL))
#define bFM4_BTIOSEL47_BTSEL4567_SEL67_3       *((volatile unsigned char*)(0x424A603CUL))

/* Base Timer 8 PPG registers */
#define bFM4_BT8_PPG_TMCR_STRG                 *((volatile unsigned char*)(0x424A8180UL))
#define bFM4_BT8_PPG_TMCR_CTEN                 *((volatile unsigned char*)(0x424A8184UL))
#define bFM4_BT8_PPG_TMCR_MDSE                 *((volatile unsigned char*)(0x424A8188UL))
#define bFM4_BT8_PPG_TMCR_OSEL                 *((volatile unsigned char*)(0x424A818CUL))
#define bFM4_BT8_PPG_TMCR_EGS0                 *((volatile unsigned char*)(0x424A81A0UL))
#define bFM4_BT8_PPG_TMCR_EGS1                 *((volatile unsigned char*)(0x424A81A4UL))
#define bFM4_BT8_PPG_TMCR_PMSK                 *((volatile unsigned char*)(0x424A81A8UL))
#define bFM4_BT8_PPG_TMCR_RTGEN                *((volatile unsigned char*)(0x424A81ACUL))
#define bFM4_BT8_PPG_TMCR_CKS0                 *((volatile unsigned char*)(0x424A81B0UL))
#define bFM4_BT8_PPG_TMCR_CKS1                 *((volatile unsigned char*)(0x424A81B4UL))
#define bFM4_BT8_PPG_TMCR_CKS2                 *((volatile unsigned char*)(0x424A81B8UL))
#define bFM4_BT8_PPG_STC_UDIR                  *((volatile unsigned char*)(0x424A8200UL))
#define bFM4_BT8_PPG_STC_TGIR                  *((volatile unsigned char*)(0x424A8208UL))
#define bFM4_BT8_PPG_STC_UDIE                  *((volatile unsigned char*)(0x424A8210UL))
#define bFM4_BT8_PPG_STC_TGIE                  *((volatile unsigned char*)(0x424A8218UL))
#define bFM4_BT8_PPG_TMCR2_CKS3                *((volatile unsigned char*)(0x424A8220UL))

