MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* Interrupt request read registers */
#define bFM4_INTREQ_DRQSEL_USBEP1              *((volatile unsigned char*)(0x42620000UL))
#define bFM4_INTREQ_DRQSEL_USBEP2              *((volatile unsigned char*)(0x42620004UL))
#define bFM4_INTREQ_DRQSEL_USBEP3              *((volatile unsigned char*)(0x42620008UL))
#define bFM4_INTREQ_DRQSEL_USBEP4              *((volatile unsigned char*)(0x4262000CUL))
#define bFM4_INTREQ_DRQSEL_USBEP5              *((volatile unsigned char*)(0x42620010UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN0            *((volatile unsigned char*)(0x42620014UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN1            *((volatile unsigned char*)(0x42620018UL))
#define bFM4_INTREQ_DRQSEL_ADCSCAN2            *((volatile unsigned char*)(0x4262001CUL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT0             *((volatile unsigned char*)(0x42620020UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT2             *((volatile unsigned char*)(0x42620024UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT4             *((volatile unsigned char*)(0x42620028UL))
#define bFM4_INTREQ_DRQSEL_IRQ0BT6             *((volatile unsigned char*)(0x4262002CUL))
#define bFM4_INTREQ_DRQSEL_MFS0RX              *((volatile unsigned char*)(0x42620030UL))
#define bFM4_INTREQ_DRQSEL_MFS0TX              *((volatile unsigned char*)(0x42620034UL))
#define bFM4_INTREQ_DRQSEL_MFS1RX              *((volatile unsigned char*)(0x42620038UL))
#define bFM4_INTREQ_DRQSEL_MFS1TX              *((volatile unsigned char*)(0x4262003CUL))
#define bFM4_INTREQ_DRQSEL_MFS2RX              *((volatile unsigned char*)(0x42620040UL))
#define bFM4_INTREQ_DRQSEL_MFS2TX              *((volatile unsigned char*)(0x42620044UL))
#define bFM4_INTREQ_DRQSEL_MFS3RX              *((volatile unsigned char*)(0x42620048UL))
#define bFM4_INTREQ_DRQSEL_MFS3TX              *((volatile unsigned char*)(0x4262004CUL))
#define bFM4_INTREQ_DRQSEL_MFS4RX              *((volatile unsigned char*)(0x42620050UL))
#define bFM4_INTREQ_DRQSEL_MFS4TX              *((volatile unsigned char*)(0x42620054UL))
#define bFM4_INTREQ_DRQSEL_MFS5RX              *((volatile unsigned char*)(0x42620058UL))
#define bFM4_INTREQ_DRQSEL_MFS5TX              *((volatile unsigned char*)(0x4262005CUL))
#define bFM4_INTREQ_DRQSEL_MFS6RX              *((volatile unsigned char*)(0x42620060UL))
#define bFM4_INTREQ_DRQSEL_MFS6TX              *((volatile unsigned char*)(0x42620064UL))
#define bFM4_INTREQ_DRQSEL_MFS7RX              *((volatile unsigned char*)(0x42620068UL))
#define bFM4_INTREQ_DRQSEL_MFS7TX              *((volatile unsigned char*)(0x4262006CUL))
#define bFM4_INTREQ_DRQSEL_EXINT0              *((volatile unsigned char*)(0x42620070UL))
#define bFM4_INTREQ_DRQSEL_EXINT1              *((volatile unsigned char*)(0x42620074UL))
#define bFM4_INTREQ_DRQSEL_EXINT2              *((volatile unsigned char*)(0x42620078UL))
#define bFM4_INTREQ_DRQSEL_EXINT3              *((volatile unsigned char*)(0x4262007CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS0             *((volatile unsigned char*)(0x42620200UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS1             *((volatile unsigned char*)(0x42620204UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS2             *((volatile unsigned char*)(0x42620208UL))
#define bFM4_INTREQ_ODDPKS_ODDPKS3             *((volatile unsigned char*)(0x4262020CUL))
#define bFM4_INTREQ_ODDPKS_ODDPKS4             *((volatile unsigned char*)(0x42620210UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS10           *((volatile unsigned char*)(0x42620280UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS11           *((volatile unsigned char*)(0x42620284UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS12           *((volatile unsigned char*)(0x42620288UL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS13           *((volatile unsigned char*)(0x4262028CUL))
#define bFM4_INTREQ_ODDPKS1_ODDPKS14           *((volatile unsigned char*)(0x42620290UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ0          *((volatile unsigned char*)(0x42622200UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ1          *((volatile unsigned char*)(0x42622204UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ2          *((volatile unsigned char*)(0x42622208UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ3          *((volatile unsigned char*)(0x4262220CUL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ4          *((volatile unsigned char*)(0x42622210UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ5          *((volatile unsigned char*)(0x42622214UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ6          *((volatile unsigned char*)(0x42622218UL))
#define bFM4_INTREQ_IRQ003SEL_SELIRQ7          *((volatile unsigned char*)(0x4262221CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT0          *((volatile unsigned char*)(0x42622240UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT1          *((volatile unsigned char*)(0x42622244UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT2          *((volatile unsigned char*)(0x42622248UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT3          *((volatile unsigned char*)(0x4262224CUL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT4          *((volatile unsigned char*)(0x42622250UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT5          *((volatile unsigned char*)(0x42622254UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT6          *((volatile unsigned char*)(0x42622258UL))
#define bFM4_INTREQ_IRQ003SEL_SELBIT7          *((volatile unsigned char*)(0x4262225CUL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ0          *((volatile unsigned char*)(0x42622280UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ1          *((volatile unsigned char*)(0x42622284UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ2          *((volatile unsigned char*)(0x42622288UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ3          *((volatile unsigned char*)(0x4262228CUL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ4          *((volatile unsigned char*)(0x42622290UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ5          *((volatile unsigned char*)(0x42622294UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ6          *((volatile unsigned char*)(0x42622298UL))
#define bFM4_INTREQ_IRQ004SEL_SELIRQ7          *((volatile unsigned char*)(0x4262229CUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT0          *((volatile unsigned char*)(0x426222C0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT1          *((volatile unsigned char*)(0x426222C4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT2          *((volatile unsigned char*)(0x426222C8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT3          *((volatile unsigned char*)(0x426222CCUL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT4          *((volatile unsigned char*)(0x426222D0UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT5          *((volatile unsigned char*)(0x426222D4UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT6          *((volatile unsigned char*)(0x426222D8UL))
#define bFM4_INTREQ_IRQ004SEL_SELBIT7          *((volatile unsigned char*)(0x426222DCUL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ0          *((volatile unsigned char*)(0x42622300UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ1          *((volatile unsigned char*)(0x42622304UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ2          *((volatile unsigned char*)(0x42622308UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ3          *((volatile unsigned char*)(0x4262230CUL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ4          *((volatile unsigned char*)(0x42622310UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ5          *((volatile unsigned char*)(0x42622314UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ6          *((volatile unsigned char*)(0x42622318UL))
#define bFM4_INTREQ_IRQ005SEL_SELIRQ7          *((volatile unsigned char*)(0x4262231CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT0          *((volatile unsigned char*)(0x42622340UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT1          *((volatile unsigned char*)(0x42622344UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT2          *((volatile unsigned char*)(0x42622348UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT3          *((volatile unsigned char*)(0x4262234CUL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT4          *((volatile unsigned char*)(0x42622350UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT5          *((volatile unsigned char*)(0x42622354UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT6          *((volatile unsigned char*)(0x42622358UL))
#define bFM4_INTREQ_IRQ005SEL_SELBIT7          *((volatile unsigned char*)(0x4262235CUL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ0          *((volatile unsigned char*)(0x42622380UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ1          *((volatile unsigned char*)(0x42622384UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ2          *((volatile unsigned char*)(0x42622388UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ3          *((volatile unsigned char*)(0x4262238CUL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ4          *((volatile unsigned char*)(0x42622390UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ5          *((volatile unsigned char*)(0x42622394UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ6          *((volatile unsigned char*)(0x42622398UL))
#define bFM4_INTREQ_IRQ006SEL_SELIRQ7          *((volatile unsigned char*)(0x4262239CUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT0          *((volatile unsigned char*)(0x426223C0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT1          *((volatile unsigned char*)(0x426223C4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT2          *((volatile unsigned char*)(0x426223C8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT3          *((volatile unsigned char*)(0x426223CCUL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT4          *((volatile unsigned char*)(0x426223D0UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT5          *((volatile unsigned char*)(0x426223D4UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT6          *((volatile unsigned char*)(0x426223D8UL))
#define bFM4_INTREQ_IRQ006SEL_SELBIT7          *((volatile unsigned char*)(0x426223DCUL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ0          *((volatile unsigned char*)(0x42622400UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ1          *((volatile unsigned char*)(0x42622404UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ2          *((volatile unsigned char*)(0x42622408UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ3          *((volatile unsigned char*)(0x4262240CUL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ4          *((volatile unsigned char*)(0x42622410UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ5          *((volatile unsigned char*)(0x42622414UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ6          *((volatile unsigned char*)(0x42622418UL))
#define bFM4_INTREQ_IRQ007SEL_SELIRQ7          *((volatile unsigned char*)(0x4262241CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT0          *((volatile unsigned char*)(0x42622440UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT1          *((volatile unsigned char*)(0x42622444UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT2          *((volatile unsigned char*)(0x42622448UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT3          *((volatile unsigned char*)(0x4262244CUL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT4          *((volatile unsigned char*)(0x42622450UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT5          *((volatile unsigned char*)(0x42622454UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT6          *((volatile unsigned char*)(0x42622458UL))
#define bFM4_INTREQ_IRQ007SEL_SELBIT7          *((volatile unsigned char*)(0x4262245CUL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ0          *((volatile unsigned char*)(0x42622480UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ1          *((volatile unsigned char*)(0x42622484UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ2          *((volatile unsigned char*)(0x42622488UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ3          *((volatile unsigned char*)(0x4262248CUL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ4          *((volatile unsigned char*)(0x42622490UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ5          *((volatile unsigned char*)(0x42622494UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ6          *((volatile unsigned char*)(0x42622498UL))
#define bFM4_INTREQ_IRQ008SEL_SELIRQ7          *((volatile unsigned char*)(0x4262249CUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT0          *((volatile unsigned char*)(0x426224C0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT1          *((volatile unsigned char*)(0x426224C4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT2          *((volatile unsigned char*)(0x426224C8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT3          *((volatile unsigned char*)(0x426224CCUL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT4          *((volatile unsigned char*)(0x426224D0UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT5          *((volatile unsigned char*)(0x426224D4UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT6          *((volatile unsigned char*)(0x426224D8UL))
#define bFM4_INTREQ_IRQ008SEL_SELBIT7          *((volatile unsigned char*)(0x426224DCUL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ0          *((volatile unsigned char*)(0x42622500UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ1          *((volatile unsigned char*)(0x42622504UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ2          *((volatile unsigned char*)(0x42622508UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ3          *((volatile unsigned char*)(0x4262250CUL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ4          *((volatile unsigned char*)(0x42622510UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ5          *((volatile unsigned char*)(0x42622514UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ6          *((volatile unsigned char*)(0x42622518UL))
#define bFM4_INTREQ_IRQ009SEL_SELIRQ7          *((volatile unsigned char*)(0x4262251CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT0          *((volatile unsigned char*)(0x42622540UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT1          *((volatile unsigned char*)(0x42622544UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT2          *((volatile unsigned char*)(0x42622548UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT3          *((volatile unsigned char*)(0x4262254CUL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT4          *((volatile unsigned char*)(0x42622550UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT5          *((volatile unsigned char*)(0x42622554UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT6          *((volatile unsigned char*)(0x42622558UL))
#define bFM4_INTREQ_IRQ009SEL_SELBIT7          *((volatile unsigned char*)(0x4262255CUL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ0          *((volatile unsigned char*)(0x42622580UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ1          *((volatile unsigned char*)(0x42622584UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ2          *((volatile unsigned char*)(0x42622588UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ3          *((volatile unsigned char*)(0x4262258CUL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ4          *((volatile unsigned char*)(0x42622590UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ5          *((volatile unsigned char*)(0x42622594UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ6          *((volatile unsigned char*)(0x42622598UL))
#define bFM4_INTREQ_IRQ010SEL_SELIRQ7          *((volatile unsigned char*)(0x4262259CUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT0          *((volatile unsigned char*)(0x426225C0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT1          *((volatile unsigned char*)(0x426225C4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT2          *((volatile unsigned char*)(0x426225C8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT3          *((volatile unsigned char*)(0x426225CCUL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT4          *((volatile unsigned char*)(0x426225D0UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT5          *((volatile unsigned char*)(0x426225D4UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT6          *((volatile unsigned char*)(0x426225D8UL))
#define bFM4_INTREQ_IRQ010SEL_SELBIT7          *((volatile unsigned char*)(0x426225DCUL))
#define bFM4_INTREQ_EXC02MON_NMI               *((volatile unsigned char*)(0x42624000UL))
#define bFM4_INTREQ_EXC02MON_HWINT             *((volatile unsigned char*)(0x42624004UL))
#define bFM4_INTREQ_IRQ000MON_FCSINT           *((volatile unsigned char*)(0x42624080UL))
#define bFM4_INTREQ_IRQ001MON_SWWDTINT         *((volatile unsigned char*)(0x42624100UL))
#define bFM4_INTREQ_IRQ002MON_LVDINT           *((volatile unsigned char*)(0x42624180UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT0          *((volatile unsigned char*)(0x42624200UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT1          *((volatile unsigned char*)(0x42624204UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT2          *((volatile unsigned char*)(0x42624208UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT3          *((volatile unsigned char*)(0x4262420CUL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT4          *((volatile unsigned char*)(0x42624210UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT5          *((volatile unsigned char*)(0x42624214UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT6          *((volatile unsigned char*)(0x42624218UL))
#define bFM4_INTREQ_IRQ003MON_IRQBIT7          *((volatile unsigned char*)(0x4262421CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT0          *((volatile unsigned char*)(0x42624280UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT1          *((volatile unsigned char*)(0x42624284UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT2          *((volatile unsigned char*)(0x42624288UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT3          *((volatile unsigned char*)(0x4262428CUL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT4          *((volatile unsigned char*)(0x42624290UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT5          *((volatile unsigned char*)(0x42624294UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT6          *((volatile unsigned char*)(0x42624298UL))
#define bFM4_INTREQ_IRQ004MON_IRQBIT7          *((volatile unsigned char*)(0x4262429CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT0          *((volatile unsigned char*)(0x42624300UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT1          *((volatile unsigned char*)(0x42624304UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT2          *((volatile unsigned char*)(0x42624308UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT3          *((volatile unsigned char*)(0x4262430CUL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT4          *((volatile unsigned char*)(0x42624310UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT5          *((volatile unsigned char*)(0x42624314UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT6          *((volatile unsigned char*)(0x42624318UL))
#define bFM4_INTREQ_IRQ005MON_IRQBIT7          *((volatile unsigned char*)(0x4262431CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT0          *((volatile unsigned char*)(0x42624380UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT1          *((volatile unsigned char*)(0x42624384UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT2          *((volatile unsigned char*)(0x42624388UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT3          *((volatile unsigned char*)(0x4262438CUL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT4          *((volatile unsigned char*)(0x42624390UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT5          *((volatile unsigned char*)(0x42624394UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT6          *((volatile unsigned char*)(0x42624398UL))
#define bFM4_INTREQ_IRQ006MON_IRQBIT7          *((volatile unsigned char*)(0x4262439CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT0          *((volatile unsigned char*)(0x42624400UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT1          *((volatile unsigned char*)(0x42624404UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT2          *((volatile unsigned char*)(0x42624408UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT3          *((volatile unsigned char*)(0x4262440CUL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT4          *((volatile unsigned char*)(0x42624410UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT5          *((volatile unsigned char*)(0x42624414UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT6          *((volatile unsigned char*)(0x42624418UL))
#define bFM4_INTREQ_IRQ007MON_IRQBIT7          *((volatile unsigned char*)(0x4262441CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT0          *((volatile unsigned char*)(0x42624480UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT1          *((volatile unsigned char*)(0x42624484UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT2          *((volatile unsigned char*)(0x42624488UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT3          *((volatile unsigned char*)(0x4262448CUL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT4          *((volatile unsigned char*)(0x42624490UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT5          *((volatile unsigned char*)(0x42624494UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT6          *((volatile unsigned char*)(0x42624498UL))
#define bFM4_INTREQ_IRQ008MON_IRQBIT7          *((volatile unsigned char*)(0x4262449CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT0          *((volatile unsigned char*)(0x42624500UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT1          *((volatile unsigned char*)(0x42624504UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT2          *((volatile unsigned char*)(0x42624508UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT3          *((volatile unsigned char*)(0x4262450CUL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT4          *((volatile unsigned char*)(0x42624510UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT5          *((volatile unsigned char*)(0x42624514UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT6          *((volatile unsigned char*)(0x42624518UL))
#define bFM4_INTREQ_IRQ009MON_IRQBIT7          *((volatile unsigned char*)(0x4262451CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT0          *((volatile unsigned char*)(0x42624580UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT1          *((volatile unsigned char*)(0x42624584UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT2          *((volatile unsigned char*)(0x42624588UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT3          *((volatile unsigned char*)(0x4262458CUL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT4          *((volatile unsigned char*)(0x42624590UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT5          *((volatile unsigned char*)(0x42624594UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT6          *((volatile unsigned char*)(0x42624598UL))
#define bFM4_INTREQ_IRQ010MON_IRQBIT7          *((volatile unsigned char*)(0x4262459CUL))
#define bFM4_INTREQ_IRQ011MON_EXTINT           *((volatile unsigned char*)(0x42624600UL))
#define bFM4_INTREQ_IRQ012MON_EXTINT           *((volatile unsigned char*)(0x42624680UL))
#define bFM4_INTREQ_IRQ013MON_EXTINT           *((volatile unsigned char*)(0x42624700UL))
#define bFM4_INTREQ_IRQ014MON_EXTINT           *((volatile unsigned char*)(0x42624780UL))
#define bFM4_INTREQ_IRQ015MON_EXTINT           *((volatile unsigned char*)(0x42624800UL))
#define bFM4_INTREQ_IRQ016MON_EXTINT           *((volatile unsigned char*)(0x42624880UL))
#define bFM4_INTREQ_IRQ017MON_EXTINT           *((volatile unsigned char*)(0x42624900UL))
#define bFM4_INTREQ_IRQ018MON_EXTINT           *((volatile unsigned char*)(0x42624980UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT0          *((volatile unsigned char*)(0x42624A00UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT1          *((volatile unsigned char*)(0x42624A04UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT2          *((volatile unsigned char*)(0x42624A08UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT3          *((volatile unsigned char*)(0x42624A0CUL))
#define bFM4_INTREQ_IRQ019MON_QUDINT4          *((volatile unsigned char*)(0x42624A10UL))
#define bFM4_INTREQ_IRQ019MON_QUDINT5          *((volatile unsigned char*)(0x42624A14UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT0          *((volatile unsigned char*)(0x42624A80UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT1          *((volatile unsigned char*)(0x42624A84UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT2          *((volatile unsigned char*)(0x42624A88UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT3          *((volatile unsigned char*)(0x42624A8CUL))
#define bFM4_INTREQ_IRQ020MON_QUDINT4          *((volatile unsigned char*)(0x42624A90UL))
#define bFM4_INTREQ_IRQ020MON_QUDINT5          *((volatile unsigned char*)(0x42624A94UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT0         *((volatile unsigned char*)(0x42624B00UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT1         *((volatile unsigned char*)(0x42624B04UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT2         *((volatile unsigned char*)(0x42624B08UL))
#define bFM4_INTREQ_IRQ021MON_WAVEINT3         *((volatile unsigned char*)(0x42624B0CUL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT0         *((volatile unsigned char*)(0x42624B80UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT1         *((volatile unsigned char*)(0x42624B84UL))
#define bFM4_INTREQ_IRQ022MON_WAVEINT2         *((volatile unsigned char*)(0x42624B88UL))
