MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* MFS CSIO channel 0 registers */
#define bFM4_MFS0_CSIO_SMR_SOE                 *((volatile unsigned char*)(0x42700000UL))
#define bFM4_MFS0_CSIO_SMR_SCKE                *((volatile unsigned char*)(0x42700004UL))
#define bFM4_MFS0_CSIO_SMR_BDS                 *((volatile unsigned char*)(0x42700008UL))
#define bFM4_MFS0_CSIO_SMR_SCINV               *((volatile unsigned char*)(0x4270000CUL))
#define bFM4_MFS0_CSIO_SMR_MD0                 *((volatile unsigned char*)(0x42700014UL))
#define bFM4_MFS0_CSIO_SMR_MD1                 *((volatile unsigned char*)(0x42700018UL))
#define bFM4_MFS0_CSIO_SMR_MD2                 *((volatile unsigned char*)(0x4270001CUL))
#define bFM4_MFS0_CSIO_SCR_TXE                 *((volatile unsigned char*)(0x42700020UL))
#define bFM4_MFS0_CSIO_SCR_RXE                 *((volatile unsigned char*)(0x42700024UL))
#define bFM4_MFS0_CSIO_SCR_TBIE                *((volatile unsigned char*)(0x42700028UL))
#define bFM4_MFS0_CSIO_SCR_TIE                 *((volatile unsigned char*)(0x4270002CUL))
#define bFM4_MFS0_CSIO_SCR_RIE                 *((volatile unsigned char*)(0x42700030UL))
#define bFM4_MFS0_CSIO_SCR_SPI                 *((volatile unsigned char*)(0x42700034UL))
#define bFM4_MFS0_CSIO_SCR_MS                  *((volatile unsigned char*)(0x42700038UL))
#define bFM4_MFS0_CSIO_SCR_UPCL                *((volatile unsigned char*)(0x4270003CUL))
#define bFM4_MFS0_CSIO_ESCR_L0                 *((volatile unsigned char*)(0x42700080UL))
#define bFM4_MFS0_CSIO_ESCR_L1                 *((volatile unsigned char*)(0x42700084UL))
#define bFM4_MFS0_CSIO_ESCR_L2                 *((volatile unsigned char*)(0x42700088UL))
#define bFM4_MFS0_CSIO_ESCR_WT0                *((volatile unsigned char*)(0x4270008CUL))
#define bFM4_MFS0_CSIO_ESCR_WT1                *((volatile unsigned char*)(0x42700090UL))
#define bFM4_MFS0_CSIO_ESCR_CSFE               *((volatile unsigned char*)(0x42700094UL))
#define bFM4_MFS0_CSIO_ESCR_L3                 *((volatile unsigned char*)(0x42700098UL))
#define bFM4_MFS0_CSIO_ESCR_SOP                *((volatile unsigned char*)(0x4270009CUL))
#define bFM4_MFS0_CSIO_SSR_TBI                 *((volatile unsigned char*)(0x427000A0UL))
#define bFM4_MFS0_CSIO_SSR_TDRE                *((volatile unsigned char*)(0x427000A4UL))
#define bFM4_MFS0_CSIO_SSR_RDRF                *((volatile unsigned char*)(0x427000A8UL))
#define bFM4_MFS0_CSIO_SSR_ORE                 *((volatile unsigned char*)(0x427000ACUL))
#define bFM4_MFS0_CSIO_SSR_AWC                 *((volatile unsigned char*)(0x427000B0UL))
#define bFM4_MFS0_CSIO_SSR_REC                 *((volatile unsigned char*)(0x427000BCUL))
#define bFM4_MFS0_CSIO_FCR_FE1                 *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_CSIO_FCR_FE2                 *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_CSIO_FCR_FCL1                *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_CSIO_FCR_FCL2                *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_CSIO_FCR_FSET                *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_CSIO_FCR_FLD                 *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_CSIO_FCR_FLST                *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_CSIO_FCR_FSEL                *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_CSIO_FCR_FTIE                *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_CSIO_FCR_FDRQ                *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_CSIO_FCR_FRIIE               *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_CSIO_FCR_FLSTE               *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_CSIO_FCR0_FE1                *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_CSIO_FCR0_FE2                *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_CSIO_FCR0_FCL1               *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_CSIO_FCR0_FCL2               *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_CSIO_FCR0_FSET               *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_CSIO_FCR0_FLD                *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_CSIO_FCR0_FLST               *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_CSIO_FCR1_FSEL               *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_CSIO_FCR1_FTIE               *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_CSIO_FCR1_FDRQ               *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_CSIO_FCR1_FRIIE              *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_CSIO_FCR1_FLSTE              *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_CSIO_FBYTE_FD0               *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_CSIO_FBYTE_FD1               *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_CSIO_FBYTE_FD2               *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_CSIO_FBYTE_FD3               *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_CSIO_FBYTE_FD4               *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_CSIO_FBYTE_FD5               *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_CSIO_FBYTE_FD6               *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_CSIO_FBYTE_FD7               *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_CSIO_FBYTE_FD8               *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_CSIO_FBYTE_FD9               *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_CSIO_FBYTE_FD10              *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_CSIO_FBYTE_FD11              *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_CSIO_FBYTE_FD12              *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_CSIO_FBYTE_FD13              *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_CSIO_FBYTE_FD14              *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_CSIO_FBYTE_FD15              *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_CSIO_FBYTE1_FD0              *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD1              *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD2              *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD3              *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_CSIO_FBYTE1_FD4              *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD5              *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD6              *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_CSIO_FBYTE1_FD7              *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_CSIO_FBYTE2_FD8              *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD9              *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD10             *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD11             *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_CSIO_FBYTE2_FD12             *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD13             *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD14             *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_CSIO_FBYTE2_FD15             *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD0           *((volatile unsigned char*)(0x42700380UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD1           *((volatile unsigned char*)(0x42700384UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD2           *((volatile unsigned char*)(0x42700388UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD3           *((volatile unsigned char*)(0x4270038CUL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD4           *((volatile unsigned char*)(0x42700390UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD5           *((volatile unsigned char*)(0x42700394UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD6           *((volatile unsigned char*)(0x42700398UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSHD7           *((volatile unsigned char*)(0x4270039CUL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU0           *((volatile unsigned char*)(0x427003A0UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU1           *((volatile unsigned char*)(0x427003A4UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU2           *((volatile unsigned char*)(0x427003A8UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU3           *((volatile unsigned char*)(0x427003ACUL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU4           *((volatile unsigned char*)(0x427003B0UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU5           *((volatile unsigned char*)(0x427003B4UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU6           *((volatile unsigned char*)(0x427003B8UL))
#define bFM4_MFS0_CSIO_SCSTR10_CSSU7           *((volatile unsigned char*)(0x427003BCUL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS0           *((volatile unsigned char*)(0x42700400UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS1           *((volatile unsigned char*)(0x42700404UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS2           *((volatile unsigned char*)(0x42700408UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS3           *((volatile unsigned char*)(0x4270040CUL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS4           *((volatile unsigned char*)(0x42700410UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS5           *((volatile unsigned char*)(0x42700414UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS6           *((volatile unsigned char*)(0x42700418UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS7           *((volatile unsigned char*)(0x4270041CUL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS8           *((volatile unsigned char*)(0x42700420UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS9           *((volatile unsigned char*)(0x42700424UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS10          *((volatile unsigned char*)(0x42700428UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS11          *((volatile unsigned char*)(0x4270042CUL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS12          *((volatile unsigned char*)(0x42700430UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS13          *((volatile unsigned char*)(0x42700434UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS14          *((volatile unsigned char*)(0x42700438UL))
#define bFM4_MFS0_CSIO_SCSTR32_CSDS15          *((volatile unsigned char*)(0x4270043CUL))
#define bFM4_MFS0_CSIO_SACSR_TMRE              *((volatile unsigned char*)(0x42700480UL))
#define bFM4_MFS0_CSIO_SACSR_TDIV0             *((volatile unsigned char*)(0x42700484UL))
#define bFM4_MFS0_CSIO_SACSR_TDIV1             *((volatile unsigned char*)(0x42700488UL))
#define bFM4_MFS0_CSIO_SACSR_TDIV2             *((volatile unsigned char*)(0x4270048CUL))
#define bFM4_MFS0_CSIO_SACSR_TDIV3             *((volatile unsigned char*)(0x42700490UL))
#define bFM4_MFS0_CSIO_SACSR_TSYNE             *((volatile unsigned char*)(0x42700498UL))
#define bFM4_MFS0_CSIO_SACSR_TINTE             *((volatile unsigned char*)(0x4270049CUL))
#define bFM4_MFS0_CSIO_SACSR_TINT              *((volatile unsigned char*)(0x427004A0UL))
#define bFM4_MFS0_CSIO_SACSR_CSE               *((volatile unsigned char*)(0x427004ACUL))
#define bFM4_MFS0_CSIO_SACSR_CSEIE             *((volatile unsigned char*)(0x427004B0UL))
#define bFM4_MFS0_CSIO_SACSR_TBEEN             *((volatile unsigned char*)(0x427004B4UL))
#define bFM4_MFS0_CSIO_STMR_TM0                *((volatile unsigned char*)(0x42700500UL))
#define bFM4_MFS0_CSIO_STMR_TM1                *((volatile unsigned char*)(0x42700504UL))
#define bFM4_MFS0_CSIO_STMR_TM2                *((volatile unsigned char*)(0x42700508UL))
#define bFM4_MFS0_CSIO_STMR_TM3                *((volatile unsigned char*)(0x4270050CUL))
#define bFM4_MFS0_CSIO_STMR_TM4                *((volatile unsigned char*)(0x42700510UL))
#define bFM4_MFS0_CSIO_STMR_TM5                *((volatile unsigned char*)(0x42700514UL))
#define bFM4_MFS0_CSIO_STMR_TM6                *((volatile unsigned char*)(0x42700518UL))
#define bFM4_MFS0_CSIO_STMR_TM7                *((volatile unsigned char*)(0x4270051CUL))
#define bFM4_MFS0_CSIO_STMR_TM8                *((volatile unsigned char*)(0x42700520UL))
#define bFM4_MFS0_CSIO_STMR_TM9                *((volatile unsigned char*)(0x42700524UL))
#define bFM4_MFS0_CSIO_STMR_TM10               *((volatile unsigned char*)(0x42700528UL))
#define bFM4_MFS0_CSIO_STMR_TM11               *((volatile unsigned char*)(0x4270052CUL))
#define bFM4_MFS0_CSIO_STMR_TM12               *((volatile unsigned char*)(0x42700530UL))
#define bFM4_MFS0_CSIO_STMR_TM13               *((volatile unsigned char*)(0x42700534UL))
#define bFM4_MFS0_CSIO_STMR_TM14               *((volatile unsigned char*)(0x42700538UL))
#define bFM4_MFS0_CSIO_STMR_TM15               *((volatile unsigned char*)(0x4270053CUL))
#define bFM4_MFS0_CSIO_STMCR_TC0               *((volatile unsigned char*)(0x42700580UL))
#define bFM4_MFS0_CSIO_STMCR_TC1               *((volatile unsigned char*)(0x42700584UL))
#define bFM4_MFS0_CSIO_STMCR_TC2               *((volatile unsigned char*)(0x42700588UL))
#define bFM4_MFS0_CSIO_STMCR_TC3               *((volatile unsigned char*)(0x4270058CUL))
#define bFM4_MFS0_CSIO_STMCR_TC4               *((volatile unsigned char*)(0x42700590UL))
#define bFM4_MFS0_CSIO_STMCR_TC5               *((volatile unsigned char*)(0x42700594UL))
#define bFM4_MFS0_CSIO_STMCR_TC6               *((volatile unsigned char*)(0x42700598UL))
#define bFM4_MFS0_CSIO_STMCR_TC7               *((volatile unsigned char*)(0x4270059CUL))
#define bFM4_MFS0_CSIO_STMCR_TC8               *((volatile unsigned char*)(0x427005A0UL))
#define bFM4_MFS0_CSIO_STMCR_TC9               *((volatile unsigned char*)(0x427005A4UL))
#define bFM4_MFS0_CSIO_STMCR_TC10              *((volatile unsigned char*)(0x427005A8UL))
#define bFM4_MFS0_CSIO_STMCR_TC11              *((volatile unsigned char*)(0x427005ACUL))
#define bFM4_MFS0_CSIO_STMCR_TC12              *((volatile unsigned char*)(0x427005B0UL))
#define bFM4_MFS0_CSIO_STMCR_TC13              *((volatile unsigned char*)(0x427005B4UL))
#define bFM4_MFS0_CSIO_STMCR_TC14              *((volatile unsigned char*)(0x427005B8UL))
#define bFM4_MFS0_CSIO_STMCR_TC15              *((volatile unsigned char*)(0x427005BCUL))
#define bFM4_MFS0_CSIO_SCSCR_CSOE              *((volatile unsigned char*)(0x42700600UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN0             *((volatile unsigned char*)(0x42700604UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN1             *((volatile unsigned char*)(0x42700608UL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN2             *((volatile unsigned char*)(0x4270060CUL))
#define bFM4_MFS0_CSIO_SCSCR_CSEN3             *((volatile unsigned char*)(0x42700610UL))
#define bFM4_MFS0_CSIO_SCSCR_CSLVL             *((volatile unsigned char*)(0x42700614UL))
#define bFM4_MFS0_CSIO_SCSCR_CDIV0             *((volatile unsigned char*)(0x42700618UL))
#define bFM4_MFS0_CSIO_SCSCR_CDIV1             *((volatile unsigned char*)(0x4270061CUL))
#define bFM4_MFS0_CSIO_SCSCR_CDIV2             *((volatile unsigned char*)(0x42700620UL))
#define bFM4_MFS0_CSIO_SCSCR_SCAM              *((volatile unsigned char*)(0x42700624UL))
#define bFM4_MFS0_CSIO_SCSCR_SCD0              *((volatile unsigned char*)(0x42700628UL))
#define bFM4_MFS0_CSIO_SCSCR_SCD1              *((volatile unsigned char*)(0x4270062CUL))
#define bFM4_MFS0_CSIO_SCSCR_SED0              *((volatile unsigned char*)(0x42700630UL))
#define bFM4_MFS0_CSIO_SCSCR_SED1              *((volatile unsigned char*)(0x42700634UL))
#define bFM4_MFS0_CSIO_SCSCR_SST0              *((volatile unsigned char*)(0x42700638UL))
#define bFM4_MFS0_CSIO_SCSCR_SST1              *((volatile unsigned char*)(0x4270063CUL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1L0            *((volatile unsigned char*)(0x42700680UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1L1            *((volatile unsigned char*)(0x42700684UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1L2            *((volatile unsigned char*)(0x42700688UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1L3            *((volatile unsigned char*)(0x4270068CUL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1L4            *((volatile unsigned char*)(0x42700690UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1SPI           *((volatile unsigned char*)(0x42700694UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1SCINV         *((volatile unsigned char*)(0x42700698UL))
#define bFM4_MFS0_CSIO_SCSFR0_CS1CSLVL         *((volatile unsigned char*)(0x4270069CUL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2L0            *((volatile unsigned char*)(0x427006A0UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2L1            *((volatile unsigned char*)(0x427006A4UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2L2            *((volatile unsigned char*)(0x427006A8UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2L3            *((volatile unsigned char*)(0x427006ACUL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2L4            *((volatile unsigned char*)(0x427006B0UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2SPI           *((volatile unsigned char*)(0x427006B4UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2SCINV         *((volatile unsigned char*)(0x427006B8UL))
#define bFM4_MFS0_CSIO_SCSFR1_CS2CSLVL         *((volatile unsigned char*)(0x427006BCUL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3L0            *((volatile unsigned char*)(0x42700700UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3L1            *((volatile unsigned char*)(0x42700704UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3L2            *((volatile unsigned char*)(0x42700708UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3L3            *((volatile unsigned char*)(0x4270070CUL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3L4            *((volatile unsigned char*)(0x42700710UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3SPI           *((volatile unsigned char*)(0x42700714UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3SCINV         *((volatile unsigned char*)(0x42700718UL))
#define bFM4_MFS0_CSIO_SCSFR2_CS3CSLVL         *((volatile unsigned char*)(0x4270071CUL))

