MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* MFS LIN channel 0 registers */
#define bFM4_MFS0_LIN_SMR_SOE                  *((volatile unsigned char*)(0x42700000UL))
#define bFM4_MFS0_LIN_SMR_SBL                  *((volatile unsigned char*)(0x4270000CUL))
#define bFM4_MFS0_LIN_SMR_WUCR                 *((volatile unsigned char*)(0x42700010UL))
#define bFM4_MFS0_LIN_SMR_MD0                  *((volatile unsigned char*)(0x42700014UL))
#define bFM4_MFS0_LIN_SMR_MD1                  *((volatile unsigned char*)(0x42700018UL))
#define bFM4_MFS0_LIN_SMR_MD2                  *((volatile unsigned char*)(0x4270001CUL))
#define bFM4_MFS0_LIN_SCR_TXE                  *((volatile unsigned char*)(0x42700020UL))
#define bFM4_MFS0_LIN_SCR_RXE                  *((volatile unsigned char*)(0x42700024UL))
#define bFM4_MFS0_LIN_SCR_TBIE                 *((volatile unsigned char*)(0x42700028UL))
#define bFM4_MFS0_LIN_SCR_TIE                  *((volatile unsigned char*)(0x4270002CUL))
#define bFM4_MFS0_LIN_SCR_RIE                  *((volatile unsigned char*)(0x42700030UL))
#define bFM4_MFS0_LIN_SCR_LBR                  *((volatile unsigned char*)(0x42700034UL))
#define bFM4_MFS0_LIN_SCR_MS                   *((volatile unsigned char*)(0x42700038UL))
#define bFM4_MFS0_LIN_SCR_UPCL                 *((volatile unsigned char*)(0x4270003CUL))
#define bFM4_MFS0_LIN_ESCR_DEL0                *((volatile unsigned char*)(0x42700080UL))
#define bFM4_MFS0_LIN_ESCR_DEL1                *((volatile unsigned char*)(0x42700084UL))
#define bFM4_MFS0_LIN_ESCR_LBL0                *((volatile unsigned char*)(0x42700088UL))
#define bFM4_MFS0_LIN_ESCR_LBL1                *((volatile unsigned char*)(0x4270008CUL))
#define bFM4_MFS0_LIN_ESCR_LBIE                *((volatile unsigned char*)(0x42700090UL))
#define bFM4_MFS0_LIN_ESCR_ESBL                *((volatile unsigned char*)(0x42700098UL))
#define bFM4_MFS0_LIN_SSR_TBI                  *((volatile unsigned char*)(0x427000A0UL))
#define bFM4_MFS0_LIN_SSR_TDRE                 *((volatile unsigned char*)(0x427000A4UL))
#define bFM4_MFS0_LIN_SSR_RDRF                 *((volatile unsigned char*)(0x427000A8UL))
#define bFM4_MFS0_LIN_SSR_ORE                  *((volatile unsigned char*)(0x427000ACUL))
#define bFM4_MFS0_LIN_SSR_FRE                  *((volatile unsigned char*)(0x427000B0UL))
#define bFM4_MFS0_LIN_SSR_LBD                  *((volatile unsigned char*)(0x427000B4UL))
#define bFM4_MFS0_LIN_SSR_REC                  *((volatile unsigned char*)(0x427000BCUL))
#define bFM4_MFS0_LIN_BGR_EXT                  *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_LIN_BGR1_EXT                 *((volatile unsigned char*)(0x427001BCUL))
#define bFM4_MFS0_LIN_FCR_FE1                  *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_LIN_FCR_FE2                  *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_LIN_FCR_FCL1                 *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_LIN_FCR_FCL2                 *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_LIN_FCR_FSET                 *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_LIN_FCR_FLD                  *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_LIN_FCR_FLST                 *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_LIN_FCR_FSEL                 *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_LIN_FCR_FTIE                 *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_LIN_FCR_FDRQ                 *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_LIN_FCR_FRIIE                *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_LIN_FCR_FLSTE                *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_LIN_FCR0_FE1                 *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_LIN_FCR0_FE2                 *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_LIN_FCR0_FCL1                *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_LIN_FCR0_FCL2                *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_LIN_FCR0_FSET                *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_LIN_FCR0_FLD                 *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_LIN_FCR0_FLST                *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_LIN_FCR1_FSEL                *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_LIN_FCR1_FTIE                *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_LIN_FCR1_FDRQ                *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_LIN_FCR1_FRIIE               *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_LIN_FCR1_FLSTE               *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_LIN_FBYTE_FD0                *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_LIN_FBYTE_FD1                *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_LIN_FBYTE_FD2                *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_LIN_FBYTE_FD3                *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_LIN_FBYTE_FD4                *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_LIN_FBYTE_FD5                *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_LIN_FBYTE_FD6                *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_LIN_FBYTE_FD7                *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_LIN_FBYTE_FD8                *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_LIN_FBYTE_FD9                *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_LIN_FBYTE_FD10               *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_LIN_FBYTE_FD11               *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_LIN_FBYTE_FD12               *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_LIN_FBYTE_FD13               *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_LIN_FBYTE_FD14               *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_LIN_FBYTE_FD15               *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_LIN_FBYTE1_FD0               *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_LIN_FBYTE1_FD1               *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_LIN_FBYTE1_FD2               *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_LIN_FBYTE1_FD3               *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_LIN_FBYTE1_FD4               *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_LIN_FBYTE1_FD5               *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_LIN_FBYTE1_FD6               *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_LIN_FBYTE1_FD7               *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_LIN_FBYTE2_FD8               *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_LIN_FBYTE2_FD9               *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_LIN_FBYTE2_FD10              *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_LIN_FBYTE2_FD11              *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_LIN_FBYTE2_FD12              *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_LIN_FBYTE2_FD13              *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_LIN_FBYTE2_FD14              *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_LIN_FBYTE2_FD15              *((volatile unsigned char*)(0x4270033CUL))

/* MFS I2C channel 0 registers */
#define bFM4_MFS0_I2C_SMR_TIE                  *((volatile unsigned char*)(0x42700008UL))
#define bFM4_MFS0_I2C_SMR_RIE                  *((volatile unsigned char*)(0x4270000CUL))
#define bFM4_MFS0_I2C_SMR_MD0                  *((volatile unsigned char*)(0x42700014UL))
#define bFM4_MFS0_I2C_SMR_MD1                  *((volatile unsigned char*)(0x42700018UL))
#define bFM4_MFS0_I2C_SMR_MD2                  *((volatile unsigned char*)(0x4270001CUL))
#define bFM4_MFS0_I2C_IBCR_INT                 *((volatile unsigned char*)(0x42700020UL))
#define bFM4_MFS0_I2C_IBCR_BER                 *((volatile unsigned char*)(0x42700024UL))
#define bFM4_MFS0_I2C_IBCR_INTE                *((volatile unsigned char*)(0x42700028UL))
#define bFM4_MFS0_I2C_IBCR_CNDE                *((volatile unsigned char*)(0x4270002CUL))
#define bFM4_MFS0_I2C_IBCR_WSEL                *((volatile unsigned char*)(0x42700030UL))
#define bFM4_MFS0_I2C_IBCR_ACKE                *((volatile unsigned char*)(0x42700034UL))
#define bFM4_MFS0_I2C_IBCR_ACT                 *((volatile unsigned char*)(0x42700038UL))
#define bFM4_MFS0_I2C_IBCR_SCC                 *((volatile unsigned char*)(0x42700038UL))
#define bFM4_MFS0_I2C_IBCR_MSS                 *((volatile unsigned char*)(0x4270003CUL))
#define bFM4_MFS0_I2C_IBSR_BB                  *((volatile unsigned char*)(0x42700080UL))
#define bFM4_MFS0_I2C_IBSR_SPC                 *((volatile unsigned char*)(0x42700084UL))
#define bFM4_MFS0_I2C_IBSR_RSC                 *((volatile unsigned char*)(0x42700088UL))
#define bFM4_MFS0_I2C_IBSR_AL                  *((volatile unsigned char*)(0x4270008CUL))
#define bFM4_MFS0_I2C_IBSR_TRX                 *((volatile unsigned char*)(0x42700090UL))
#define bFM4_MFS0_I2C_IBSR_RSA                 *((volatile unsigned char*)(0x42700094UL))
#define bFM4_MFS0_I2C_IBSR_RACK                *((volatile unsigned char*)(0x42700098UL))
#define bFM4_MFS0_I2C_IBSR_FBT                 *((volatile unsigned char*)(0x4270009CUL))
#define bFM4_MFS0_I2C_SSR_TBI                  *((volatile unsigned char*)(0x427000A0UL))
#define bFM4_MFS0_I2C_SSR_TDRE                 *((volatile unsigned char*)(0x427000A4UL))
#define bFM4_MFS0_I2C_SSR_RDRF                 *((volatile unsigned char*)(0x427000A8UL))
#define bFM4_MFS0_I2C_SSR_ORE                  *((volatile unsigned char*)(0x427000ACUL))
#define bFM4_MFS0_I2C_SSR_TBIE                 *((volatile unsigned char*)(0x427000B0UL))
#define bFM4_MFS0_I2C_SSR_DMA                  *((volatile unsigned char*)(0x427000B4UL))
#define bFM4_MFS0_I2C_SSR_TSET                 *((volatile unsigned char*)(0x427000B8UL))
#define bFM4_MFS0_I2C_SSR_REC                  *((volatile unsigned char*)(0x427000BCUL))
#define bFM4_MFS0_I2C_ISBA_SA0                 *((volatile unsigned char*)(0x42700200UL))
#define bFM4_MFS0_I2C_ISBA_SA1                 *((volatile unsigned char*)(0x42700204UL))
#define bFM4_MFS0_I2C_ISBA_SA2                 *((volatile unsigned char*)(0x42700208UL))
#define bFM4_MFS0_I2C_ISBA_SA3                 *((volatile unsigned char*)(0x4270020CUL))
#define bFM4_MFS0_I2C_ISBA_SA4                 *((volatile unsigned char*)(0x42700210UL))
#define bFM4_MFS0_I2C_ISBA_SA5                 *((volatile unsigned char*)(0x42700214UL))
#define bFM4_MFS0_I2C_ISBA_SA6                 *((volatile unsigned char*)(0x42700218UL))
#define bFM4_MFS0_I2C_ISBA_SAEN                *((volatile unsigned char*)(0x4270021CUL))
#define bFM4_MFS0_I2C_ISMK_SM0                 *((volatile unsigned char*)(0x42700220UL))
#define bFM4_MFS0_I2C_ISMK_SM1                 *((volatile unsigned char*)(0x42700224UL))
#define bFM4_MFS0_I2C_ISMK_SM2                 *((volatile unsigned char*)(0x42700228UL))
#define bFM4_MFS0_I2C_ISMK_SM3                 *((volatile unsigned char*)(0x4270022CUL))
#define bFM4_MFS0_I2C_ISMK_SM4                 *((volatile unsigned char*)(0x42700230UL))
#define bFM4_MFS0_I2C_ISMK_SM5                 *((volatile unsigned char*)(0x42700234UL))
#define bFM4_MFS0_I2C_ISMK_SM6                 *((volatile unsigned char*)(0x42700238UL))
#define bFM4_MFS0_I2C_ISMK_EN                  *((volatile unsigned char*)(0x4270023CUL))
#define bFM4_MFS0_I2C_FCR_FE1                  *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_I2C_FCR_FE2                  *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_I2C_FCR_FCL1                 *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_I2C_FCR_FCL2                 *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_I2C_FCR_FSET                 *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_I2C_FCR_FLD                  *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_I2C_FCR_FLST                 *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_I2C_FCR_FSEL                 *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_I2C_FCR_FTIE                 *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_I2C_FCR_FDRQ                 *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_I2C_FCR_FRIIE                *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_I2C_FCR_FLSTE                *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_I2C_FCR0_FE1                 *((volatile unsigned char*)(0x42700280UL))
#define bFM4_MFS0_I2C_FCR0_FE2                 *((volatile unsigned char*)(0x42700284UL))
#define bFM4_MFS0_I2C_FCR0_FCL1                *((volatile unsigned char*)(0x42700288UL))
#define bFM4_MFS0_I2C_FCR0_FCL2                *((volatile unsigned char*)(0x4270028CUL))
#define bFM4_MFS0_I2C_FCR0_FSET                *((volatile unsigned char*)(0x42700290UL))
#define bFM4_MFS0_I2C_FCR0_FLD                 *((volatile unsigned char*)(0x42700294UL))
#define bFM4_MFS0_I2C_FCR0_FLST                *((volatile unsigned char*)(0x42700298UL))
#define bFM4_MFS0_I2C_FCR1_FSEL                *((volatile unsigned char*)(0x427002A0UL))
#define bFM4_MFS0_I2C_FCR1_FTIE                *((volatile unsigned char*)(0x427002A4UL))
#define bFM4_MFS0_I2C_FCR1_FDRQ                *((volatile unsigned char*)(0x427002A8UL))
#define bFM4_MFS0_I2C_FCR1_FRIIE               *((volatile unsigned char*)(0x427002ACUL))
#define bFM4_MFS0_I2C_FCR1_FLSTE               *((volatile unsigned char*)(0x427002B0UL))
#define bFM4_MFS0_I2C_FBYTE_FD0                *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_I2C_FBYTE_FD1                *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_I2C_FBYTE_FD2                *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_I2C_FBYTE_FD3                *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_I2C_FBYTE_FD4                *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_I2C_FBYTE_FD5                *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_I2C_FBYTE_FD6                *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_I2C_FBYTE_FD7                *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_I2C_FBYTE_FD8                *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_I2C_FBYTE_FD9                *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_I2C_FBYTE_FD10               *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_I2C_FBYTE_FD11               *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_I2C_FBYTE_FD12               *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_I2C_FBYTE_FD13               *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_I2C_FBYTE_FD14               *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_I2C_FBYTE_FD15               *((volatile unsigned char*)(0x4270033CUL))
#define bFM4_MFS0_I2C_FBYTE1_FD0               *((volatile unsigned char*)(0x42700300UL))
#define bFM4_MFS0_I2C_FBYTE1_FD1               *((volatile unsigned char*)(0x42700304UL))
#define bFM4_MFS0_I2C_FBYTE1_FD2               *((volatile unsigned char*)(0x42700308UL))
#define bFM4_MFS0_I2C_FBYTE1_FD3               *((volatile unsigned char*)(0x4270030CUL))
#define bFM4_MFS0_I2C_FBYTE1_FD4               *((volatile unsigned char*)(0x42700310UL))
#define bFM4_MFS0_I2C_FBYTE1_FD5               *((volatile unsigned char*)(0x42700314UL))
#define bFM4_MFS0_I2C_FBYTE1_FD6               *((volatile unsigned char*)(0x42700318UL))
#define bFM4_MFS0_I2C_FBYTE1_FD7               *((volatile unsigned char*)(0x4270031CUL))
#define bFM4_MFS0_I2C_FBYTE2_FD8               *((volatile unsigned char*)(0x42700320UL))
#define bFM4_MFS0_I2C_FBYTE2_FD9               *((volatile unsigned char*)(0x42700324UL))
#define bFM4_MFS0_I2C_FBYTE2_FD10              *((volatile unsigned char*)(0x42700328UL))
#define bFM4_MFS0_I2C_FBYTE2_FD11              *((volatile unsigned char*)(0x4270032CUL))
#define bFM4_MFS0_I2C_FBYTE2_FD12              *((volatile unsigned char*)(0x42700330UL))
#define bFM4_MFS0_I2C_FBYTE2_FD13              *((volatile unsigned char*)(0x42700334UL))
#define bFM4_MFS0_I2C_FBYTE2_FD14              *((volatile unsigned char*)(0x42700338UL))
#define bFM4_MFS0_I2C_FBYTE2_FD15              *((volatile unsigned char*)(0x4270033CUL))

