MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* MFS UART channel 12 registers */
#define bFM4_MFS12_UART_SMR_SOE                *((volatile unsigned char*)(0x42718000UL))
#define bFM4_MFS12_UART_SMR_BDS                *((volatile unsigned char*)(0x42718008UL))
#define bFM4_MFS12_UART_SMR_SBL                *((volatile unsigned char*)(0x4271800CUL))
#define bFM4_MFS12_UART_SMR_WUCR               *((volatile unsigned char*)(0x42718010UL))
#define bFM4_MFS12_UART_SMR_MD0                *((volatile unsigned char*)(0x42718014UL))
#define bFM4_MFS12_UART_SMR_MD1                *((volatile unsigned char*)(0x42718018UL))
#define bFM4_MFS12_UART_SMR_MD2                *((volatile unsigned char*)(0x4271801CUL))
#define bFM4_MFS12_UART_SCR_TXE                *((volatile unsigned char*)(0x42718020UL))
#define bFM4_MFS12_UART_SCR_RXE                *((volatile unsigned char*)(0x42718024UL))
#define bFM4_MFS12_UART_SCR_TBIE               *((volatile unsigned char*)(0x42718028UL))
#define bFM4_MFS12_UART_SCR_TIE                *((volatile unsigned char*)(0x4271802CUL))
#define bFM4_MFS12_UART_SCR_RIE                *((volatile unsigned char*)(0x42718030UL))
#define bFM4_MFS12_UART_SCR_UPCL               *((volatile unsigned char*)(0x4271803CUL))
#define bFM4_MFS12_UART_ESCR_L0                *((volatile unsigned char*)(0x42718080UL))
#define bFM4_MFS12_UART_ESCR_L1                *((volatile unsigned char*)(0x42718084UL))
#define bFM4_MFS12_UART_ESCR_L2                *((volatile unsigned char*)(0x42718088UL))
#define bFM4_MFS12_UART_ESCR_P                 *((volatile unsigned char*)(0x4271808CUL))
#define bFM4_MFS12_UART_ESCR_PEN               *((volatile unsigned char*)(0x42718090UL))
#define bFM4_MFS12_UART_ESCR_INV               *((volatile unsigned char*)(0x42718094UL))
#define bFM4_MFS12_UART_ESCR_ESBL              *((volatile unsigned char*)(0x42718098UL))
#define bFM4_MFS12_UART_ESCR_FLWEN             *((volatile unsigned char*)(0x4271809CUL))
#define bFM4_MFS12_UART_SSR_TBI                *((volatile unsigned char*)(0x427180A0UL))
#define bFM4_MFS12_UART_SSR_TDRE               *((volatile unsigned char*)(0x427180A4UL))
#define bFM4_MFS12_UART_SSR_RDRF               *((volatile unsigned char*)(0x427180A8UL))
#define bFM4_MFS12_UART_SSR_ORE                *((volatile unsigned char*)(0x427180ACUL))
#define bFM4_MFS12_UART_SSR_FRE                *((volatile unsigned char*)(0x427180B0UL))
#define bFM4_MFS12_UART_SSR_PE                 *((volatile unsigned char*)(0x427180B4UL))
#define bFM4_MFS12_UART_SSR_REC                *((volatile unsigned char*)(0x427180BCUL))
#define bFM4_MFS12_UART_BGR_EXT                *((volatile unsigned char*)(0x427181BCUL))
#define bFM4_MFS12_UART_BGR1_EXT               *((volatile unsigned char*)(0x427181BCUL))
#define bFM4_MFS12_UART_FCR_FE1                *((volatile unsigned char*)(0x42718280UL))
#define bFM4_MFS12_UART_FCR_FE2                *((volatile unsigned char*)(0x42718284UL))
#define bFM4_MFS12_UART_FCR_FCL1               *((volatile unsigned char*)(0x42718288UL))
#define bFM4_MFS12_UART_FCR_FCL2               *((volatile unsigned char*)(0x4271828CUL))
#define bFM4_MFS12_UART_FCR_FSET               *((volatile unsigned char*)(0x42718290UL))
#define bFM4_MFS12_UART_FCR_FLD                *((volatile unsigned char*)(0x42718294UL))
#define bFM4_MFS12_UART_FCR_FLST               *((volatile unsigned char*)(0x42718298UL))
#define bFM4_MFS12_UART_FCR_FSEL               *((volatile unsigned char*)(0x427182A0UL))
#define bFM4_MFS12_UART_FCR_FTIE               *((volatile unsigned char*)(0x427182A4UL))
#define bFM4_MFS12_UART_FCR_FDRQ               *((volatile unsigned char*)(0x427182A8UL))
#define bFM4_MFS12_UART_FCR_FRIIE              *((volatile unsigned char*)(0x427182ACUL))
#define bFM4_MFS12_UART_FCR_FLSTE              *((volatile unsigned char*)(0x427182B0UL))
#define bFM4_MFS12_UART_FCR0_FE1               *((volatile unsigned char*)(0x42718280UL))
#define bFM4_MFS12_UART_FCR0_FE2               *((volatile unsigned char*)(0x42718284UL))
#define bFM4_MFS12_UART_FCR0_FCL1              *((volatile unsigned char*)(0x42718288UL))
#define bFM4_MFS12_UART_FCR0_FCL2              *((volatile unsigned char*)(0x4271828CUL))
#define bFM4_MFS12_UART_FCR0_FSET              *((volatile unsigned char*)(0x42718290UL))
#define bFM4_MFS12_UART_FCR0_FLD               *((volatile unsigned char*)(0x42718294UL))
#define bFM4_MFS12_UART_FCR0_FLST              *((volatile unsigned char*)(0x42718298UL))
#define bFM4_MFS12_UART_FCR1_FSEL              *((volatile unsigned char*)(0x427182A0UL))
#define bFM4_MFS12_UART_FCR1_FTIE              *((volatile unsigned char*)(0x427182A4UL))
#define bFM4_MFS12_UART_FCR1_FDRQ              *((volatile unsigned char*)(0x427182A8UL))
#define bFM4_MFS12_UART_FCR1_FRIIE             *((volatile unsigned char*)(0x427182ACUL))
#define bFM4_MFS12_UART_FCR1_FLSTE             *((volatile unsigned char*)(0x427182B0UL))
#define bFM4_MFS12_UART_FBYTE_FD0              *((volatile unsigned char*)(0x42718300UL))
#define bFM4_MFS12_UART_FBYTE_FD1              *((volatile unsigned char*)(0x42718304UL))
#define bFM4_MFS12_UART_FBYTE_FD2              *((volatile unsigned char*)(0x42718308UL))
#define bFM4_MFS12_UART_FBYTE_FD3              *((volatile unsigned char*)(0x4271830CUL))
#define bFM4_MFS12_UART_FBYTE_FD4              *((volatile unsigned char*)(0x42718310UL))
#define bFM4_MFS12_UART_FBYTE_FD5              *((volatile unsigned char*)(0x42718314UL))
#define bFM4_MFS12_UART_FBYTE_FD6              *((volatile unsigned char*)(0x42718318UL))
#define bFM4_MFS12_UART_FBYTE_FD7              *((volatile unsigned char*)(0x4271831CUL))
#define bFM4_MFS12_UART_FBYTE_FD8              *((volatile unsigned char*)(0x42718320UL))
#define bFM4_MFS12_UART_FBYTE_FD9              *((volatile unsigned char*)(0x42718324UL))
#define bFM4_MFS12_UART_FBYTE_FD10             *((volatile unsigned char*)(0x42718328UL))
#define bFM4_MFS12_UART_FBYTE_FD11             *((volatile unsigned char*)(0x4271832CUL))
#define bFM4_MFS12_UART_FBYTE_FD12             *((volatile unsigned char*)(0x42718330UL))
#define bFM4_MFS12_UART_FBYTE_FD13             *((volatile unsigned char*)(0x42718334UL))
#define bFM4_MFS12_UART_FBYTE_FD14             *((volatile unsigned char*)(0x42718338UL))
#define bFM4_MFS12_UART_FBYTE_FD15             *((volatile unsigned char*)(0x4271833CUL))
#define bFM4_MFS12_UART_FBYTE1_FD0             *((volatile unsigned char*)(0x42718300UL))
#define bFM4_MFS12_UART_FBYTE1_FD1             *((volatile unsigned char*)(0x42718304UL))
#define bFM4_MFS12_UART_FBYTE1_FD2             *((volatile unsigned char*)(0x42718308UL))
#define bFM4_MFS12_UART_FBYTE1_FD3             *((volatile unsigned char*)(0x4271830CUL))
#define bFM4_MFS12_UART_FBYTE1_FD4             *((volatile unsigned char*)(0x42718310UL))
#define bFM4_MFS12_UART_FBYTE1_FD5             *((volatile unsigned char*)(0x42718314UL))
#define bFM4_MFS12_UART_FBYTE1_FD6             *((volatile unsigned char*)(0x42718318UL))
#define bFM4_MFS12_UART_FBYTE1_FD7             *((volatile unsigned char*)(0x4271831CUL))
#define bFM4_MFS12_UART_FBYTE2_FD8             *((volatile unsigned char*)(0x42718320UL))
#define bFM4_MFS12_UART_FBYTE2_FD9             *((volatile unsigned char*)(0x42718324UL))
#define bFM4_MFS12_UART_FBYTE2_FD10            *((volatile unsigned char*)(0x42718328UL))
#define bFM4_MFS12_UART_FBYTE2_FD11            *((volatile unsigned char*)(0x4271832CUL))
#define bFM4_MFS12_UART_FBYTE2_FD12            *((volatile unsigned char*)(0x42718330UL))
#define bFM4_MFS12_UART_FBYTE2_FD13            *((volatile unsigned char*)(0x42718334UL))
#define bFM4_MFS12_UART_FBYTE2_FD14            *((volatile unsigned char*)(0x42718338UL))
#define bFM4_MFS12_UART_FBYTE2_FD15            *((volatile unsigned char*)(0x4271833CUL))

