MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
/* MFS UART channel 15 registers */
#define bFM4_MFS15_UART_SMR_SOE                *((volatile unsigned char*)(0x4271E000UL))
#define bFM4_MFS15_UART_SMR_BDS                *((volatile unsigned char*)(0x4271E008UL))
#define bFM4_MFS15_UART_SMR_SBL                *((volatile unsigned char*)(0x4271E00CUL))
#define bFM4_MFS15_UART_SMR_WUCR               *((volatile unsigned char*)(0x4271E010UL))
#define bFM4_MFS15_UART_SMR_MD0                *((volatile unsigned char*)(0x4271E014UL))
#define bFM4_MFS15_UART_SMR_MD1                *((volatile unsigned char*)(0x4271E018UL))
#define bFM4_MFS15_UART_SMR_MD2                *((volatile unsigned char*)(0x4271E01CUL))
#define bFM4_MFS15_UART_SCR_TXE                *((volatile unsigned char*)(0x4271E020UL))
#define bFM4_MFS15_UART_SCR_RXE                *((volatile unsigned char*)(0x4271E024UL))
#define bFM4_MFS15_UART_SCR_TBIE               *((volatile unsigned char*)(0x4271E028UL))
#define bFM4_MFS15_UART_SCR_TIE                *((volatile unsigned char*)(0x4271E02CUL))
#define bFM4_MFS15_UART_SCR_RIE                *((volatile unsigned char*)(0x4271E030UL))
#define bFM4_MFS15_UART_SCR_UPCL               *((volatile unsigned char*)(0x4271E03CUL))
#define bFM4_MFS15_UART_ESCR_L0                *((volatile unsigned char*)(0x4271E080UL))
#define bFM4_MFS15_UART_ESCR_L1                *((volatile unsigned char*)(0x4271E084UL))
#define bFM4_MFS15_UART_ESCR_L2                *((volatile unsigned char*)(0x4271E088UL))
#define bFM4_MFS15_UART_ESCR_P                 *((volatile unsigned char*)(0x4271E08CUL))
#define bFM4_MFS15_UART_ESCR_PEN               *((volatile unsigned char*)(0x4271E090UL))
#define bFM4_MFS15_UART_ESCR_INV               *((volatile unsigned char*)(0x4271E094UL))
#define bFM4_MFS15_UART_ESCR_ESBL              *((volatile unsigned char*)(0x4271E098UL))
#define bFM4_MFS15_UART_ESCR_FLWEN             *((volatile unsigned char*)(0x4271E09CUL))
#define bFM4_MFS15_UART_SSR_TBI                *((volatile unsigned char*)(0x4271E0A0UL))
#define bFM4_MFS15_UART_SSR_TDRE               *((volatile unsigned char*)(0x4271E0A4UL))
#define bFM4_MFS15_UART_SSR_RDRF               *((volatile unsigned char*)(0x4271E0A8UL))
#define bFM4_MFS15_UART_SSR_ORE                *((volatile unsigned char*)(0x4271E0ACUL))
#define bFM4_MFS15_UART_SSR_FRE                *((volatile unsigned char*)(0x4271E0B0UL))
#define bFM4_MFS15_UART_SSR_PE                 *((volatile unsigned char*)(0x4271E0B4UL))
#define bFM4_MFS15_UART_SSR_REC                *((volatile unsigned char*)(0x4271E0BCUL))
#define bFM4_MFS15_UART_BGR_EXT                *((volatile unsigned char*)(0x4271E1BCUL))
#define bFM4_MFS15_UART_BGR1_EXT               *((volatile unsigned char*)(0x4271E1BCUL))
#define bFM4_MFS15_UART_FCR_FE1                *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_UART_FCR_FE2                *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_UART_FCR_FCL1               *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_UART_FCR_FCL2               *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_UART_FCR_FSET               *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_UART_FCR_FLD                *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_UART_FCR_FLST               *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_UART_FCR_FSEL               *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_UART_FCR_FTIE               *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_UART_FCR_FDRQ               *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_UART_FCR_FRIIE              *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_UART_FCR_FLSTE              *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_UART_FCR0_FE1               *((volatile unsigned char*)(0x4271E280UL))
#define bFM4_MFS15_UART_FCR0_FE2               *((volatile unsigned char*)(0x4271E284UL))
#define bFM4_MFS15_UART_FCR0_FCL1              *((volatile unsigned char*)(0x4271E288UL))
#define bFM4_MFS15_UART_FCR0_FCL2              *((volatile unsigned char*)(0x4271E28CUL))
#define bFM4_MFS15_UART_FCR0_FSET              *((volatile unsigned char*)(0x4271E290UL))
#define bFM4_MFS15_UART_FCR0_FLD               *((volatile unsigned char*)(0x4271E294UL))
#define bFM4_MFS15_UART_FCR0_FLST              *((volatile unsigned char*)(0x4271E298UL))
#define bFM4_MFS15_UART_FCR1_FSEL              *((volatile unsigned char*)(0x4271E2A0UL))
#define bFM4_MFS15_UART_FCR1_FTIE              *((volatile unsigned char*)(0x4271E2A4UL))
#define bFM4_MFS15_UART_FCR1_FDRQ              *((volatile unsigned char*)(0x4271E2A8UL))
#define bFM4_MFS15_UART_FCR1_FRIIE             *((volatile unsigned char*)(0x4271E2ACUL))
#define bFM4_MFS15_UART_FCR1_FLSTE             *((volatile unsigned char*)(0x4271E2B0UL))
#define bFM4_MFS15_UART_FBYTE_FD0              *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_UART_FBYTE_FD1              *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_UART_FBYTE_FD2              *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_UART_FBYTE_FD3              *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_UART_FBYTE_FD4              *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_UART_FBYTE_FD5              *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_UART_FBYTE_FD6              *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_UART_FBYTE_FD7              *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_UART_FBYTE_FD8              *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_UART_FBYTE_FD9              *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_UART_FBYTE_FD10             *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_UART_FBYTE_FD11             *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_UART_FBYTE_FD12             *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_UART_FBYTE_FD13             *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_UART_FBYTE_FD14             *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_UART_FBYTE_FD15             *((volatile unsigned char*)(0x4271E33CUL))
#define bFM4_MFS15_UART_FBYTE1_FD0             *((volatile unsigned char*)(0x4271E300UL))
#define bFM4_MFS15_UART_FBYTE1_FD1             *((volatile unsigned char*)(0x4271E304UL))
#define bFM4_MFS15_UART_FBYTE1_FD2             *((volatile unsigned char*)(0x4271E308UL))
#define bFM4_MFS15_UART_FBYTE1_FD3             *((volatile unsigned char*)(0x4271E30CUL))
#define bFM4_MFS15_UART_FBYTE1_FD4             *((volatile unsigned char*)(0x4271E310UL))
#define bFM4_MFS15_UART_FBYTE1_FD5             *((volatile unsigned char*)(0x4271E314UL))
#define bFM4_MFS15_UART_FBYTE1_FD6             *((volatile unsigned char*)(0x4271E318UL))
#define bFM4_MFS15_UART_FBYTE1_FD7             *((volatile unsigned char*)(0x4271E31CUL))
#define bFM4_MFS15_UART_FBYTE2_FD8             *((volatile unsigned char*)(0x4271E320UL))
#define bFM4_MFS15_UART_FBYTE2_FD9             *((volatile unsigned char*)(0x4271E324UL))
#define bFM4_MFS15_UART_FBYTE2_FD10            *((volatile unsigned char*)(0x4271E328UL))
#define bFM4_MFS15_UART_FBYTE2_FD11            *((volatile unsigned char*)(0x4271E32CUL))
#define bFM4_MFS15_UART_FBYTE2_FD12            *((volatile unsigned char*)(0x4271E330UL))
#define bFM4_MFS15_UART_FBYTE2_FD13            *((volatile unsigned char*)(0x4271E334UL))
#define bFM4_MFS15_UART_FBYTE2_FD14            *((volatile unsigned char*)(0x4271E338UL))
#define bFM4_MFS15_UART_FBYTE2_FD15            *((volatile unsigned char*)(0x4271E33CUL))

