MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
#define bFM4_CAN1_INTPND_INTPND1               *((volatile unsigned char*)(0x42C61400UL))
#define bFM4_CAN1_INTPND_INTPND2               *((volatile unsigned char*)(0x42C61404UL))
#define bFM4_CAN1_INTPND_INTPND3               *((volatile unsigned char*)(0x42C61408UL))
#define bFM4_CAN1_INTPND_INTPND4               *((volatile unsigned char*)(0x42C6140CUL))
#define bFM4_CAN1_INTPND_INTPND5               *((volatile unsigned char*)(0x42C61410UL))
#define bFM4_CAN1_INTPND_INTPND6               *((volatile unsigned char*)(0x42C61414UL))
#define bFM4_CAN1_INTPND_INTPND7               *((volatile unsigned char*)(0x42C61418UL))
#define bFM4_CAN1_INTPND_INTPND8               *((volatile unsigned char*)(0x42C6141CUL))
#define bFM4_CAN1_INTPND_INTPND9               *((volatile unsigned char*)(0x42C61420UL))
#define bFM4_CAN1_INTPND_INTPND10              *((volatile unsigned char*)(0x42C61424UL))
#define bFM4_CAN1_INTPND_INTPND11              *((volatile unsigned char*)(0x42C61428UL))
#define bFM4_CAN1_INTPND_INTPND12              *((volatile unsigned char*)(0x42C6142CUL))
#define bFM4_CAN1_INTPND_INTPND13              *((volatile unsigned char*)(0x42C61430UL))
#define bFM4_CAN1_INTPND_INTPND14              *((volatile unsigned char*)(0x42C61434UL))
#define bFM4_CAN1_INTPND_INTPND15              *((volatile unsigned char*)(0x42C61438UL))
#define bFM4_CAN1_INTPND_INTPND16              *((volatile unsigned char*)(0x42C6143CUL))
#define bFM4_CAN1_INTPND_INTPND17              *((volatile unsigned char*)(0x42C61440UL))
#define bFM4_CAN1_INTPND_INTPND18              *((volatile unsigned char*)(0x42C61444UL))
#define bFM4_CAN1_INTPND_INTPND19              *((volatile unsigned char*)(0x42C61448UL))
#define bFM4_CAN1_INTPND_INTPND20              *((volatile unsigned char*)(0x42C6144CUL))
#define bFM4_CAN1_INTPND_INTPND21              *((volatile unsigned char*)(0x42C61450UL))
#define bFM4_CAN1_INTPND_INTPND22              *((volatile unsigned char*)(0x42C61454UL))
#define bFM4_CAN1_INTPND_INTPND23              *((volatile unsigned char*)(0x42C61458UL))
#define bFM4_CAN1_INTPND_INTPND24              *((volatile unsigned char*)(0x42C6145CUL))
#define bFM4_CAN1_INTPND_INTPND25              *((volatile unsigned char*)(0x42C61460UL))
#define bFM4_CAN1_INTPND_INTPND26              *((volatile unsigned char*)(0x42C61464UL))
#define bFM4_CAN1_INTPND_INTPND27              *((volatile unsigned char*)(0x42C61468UL))
#define bFM4_CAN1_INTPND_INTPND28              *((volatile unsigned char*)(0x42C6146CUL))
#define bFM4_CAN1_INTPND_INTPND29              *((volatile unsigned char*)(0x42C61470UL))
#define bFM4_CAN1_INTPND_INTPND30              *((volatile unsigned char*)(0x42C61474UL))
#define bFM4_CAN1_INTPND_INTPND31              *((volatile unsigned char*)(0x42C61478UL))
#define bFM4_CAN1_INTPND_INTPND32              *((volatile unsigned char*)(0x42C6147CUL))
#define bFM4_CAN1_INTPND1_INTPND1              *((volatile unsigned char*)(0x42C61400UL))
#define bFM4_CAN1_INTPND1_INTPND2              *((volatile unsigned char*)(0x42C61404UL))
#define bFM4_CAN1_INTPND1_INTPND3              *((volatile unsigned char*)(0x42C61408UL))
#define bFM4_CAN1_INTPND1_INTPND4              *((volatile unsigned char*)(0x42C6140CUL))
#define bFM4_CAN1_INTPND1_INTPND5              *((volatile unsigned char*)(0x42C61410UL))
#define bFM4_CAN1_INTPND1_INTPND6              *((volatile unsigned char*)(0x42C61414UL))
#define bFM4_CAN1_INTPND1_INTPND7              *((volatile unsigned char*)(0x42C61418UL))
#define bFM4_CAN1_INTPND1_INTPND8              *((volatile unsigned char*)(0x42C6141CUL))
#define bFM4_CAN1_INTPND1_INTPND9              *((volatile unsigned char*)(0x42C61420UL))
#define bFM4_CAN1_INTPND1_INTPND10             *((volatile unsigned char*)(0x42C61424UL))
#define bFM4_CAN1_INTPND1_INTPND11             *((volatile unsigned char*)(0x42C61428UL))
#define bFM4_CAN1_INTPND1_INTPND12             *((volatile unsigned char*)(0x42C6142CUL))
#define bFM4_CAN1_INTPND1_INTPND13             *((volatile unsigned char*)(0x42C61430UL))
#define bFM4_CAN1_INTPND1_INTPND14             *((volatile unsigned char*)(0x42C61434UL))
#define bFM4_CAN1_INTPND1_INTPND15             *((volatile unsigned char*)(0x42C61438UL))
#define bFM4_CAN1_INTPND1_INTPND16             *((volatile unsigned char*)(0x42C6143CUL))
#define bFM4_CAN1_INTPND2_INTPND17             *((volatile unsigned char*)(0x42C61440UL))
#define bFM4_CAN1_INTPND2_INTPND18             *((volatile unsigned char*)(0x42C61444UL))
#define bFM4_CAN1_INTPND2_INTPND19             *((volatile unsigned char*)(0x42C61448UL))
#define bFM4_CAN1_INTPND2_INTPND20             *((volatile unsigned char*)(0x42C6144CUL))
#define bFM4_CAN1_INTPND2_INTPND21             *((volatile unsigned char*)(0x42C61450UL))
#define bFM4_CAN1_INTPND2_INTPND22             *((volatile unsigned char*)(0x42C61454UL))
#define bFM4_CAN1_INTPND2_INTPND23             *((volatile unsigned char*)(0x42C61458UL))
#define bFM4_CAN1_INTPND2_INTPND24             *((volatile unsigned char*)(0x42C6145CUL))
#define bFM4_CAN1_INTPND2_INTPND25             *((volatile unsigned char*)(0x42C61460UL))
#define bFM4_CAN1_INTPND2_INTPND26             *((volatile unsigned char*)(0x42C61464UL))
#define bFM4_CAN1_INTPND2_INTPND27             *((volatile unsigned char*)(0x42C61468UL))
#define bFM4_CAN1_INTPND2_INTPND28             *((volatile unsigned char*)(0x42C6146CUL))
#define bFM4_CAN1_INTPND2_INTPND29             *((volatile unsigned char*)(0x42C61470UL))
#define bFM4_CAN1_INTPND2_INTPND30             *((volatile unsigned char*)(0x42C61474UL))
#define bFM4_CAN1_INTPND2_INTPND31             *((volatile unsigned char*)(0x42C61478UL))
#define bFM4_CAN1_INTPND2_INTPND32             *((volatile unsigned char*)(0x42C6147CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL1               *((volatile unsigned char*)(0x42C61600UL))
#define bFM4_CAN1_MSGVAL_MSGVAL2               *((volatile unsigned char*)(0x42C61604UL))
#define bFM4_CAN1_MSGVAL_MSGVAL3               *((volatile unsigned char*)(0x42C61608UL))
#define bFM4_CAN1_MSGVAL_MSGVAL4               *((volatile unsigned char*)(0x42C6160CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL5               *((volatile unsigned char*)(0x42C61610UL))
#define bFM4_CAN1_MSGVAL_MSGVAL6               *((volatile unsigned char*)(0x42C61614UL))
#define bFM4_CAN1_MSGVAL_MSGVAL7               *((volatile unsigned char*)(0x42C61618UL))
#define bFM4_CAN1_MSGVAL_MSGVAL8               *((volatile unsigned char*)(0x42C6161CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL9               *((volatile unsigned char*)(0x42C61620UL))
#define bFM4_CAN1_MSGVAL_MSGVAL10              *((volatile unsigned char*)(0x42C61624UL))
#define bFM4_CAN1_MSGVAL_MSGVAL11              *((volatile unsigned char*)(0x42C61628UL))
#define bFM4_CAN1_MSGVAL_MSGVAL12              *((volatile unsigned char*)(0x42C6162CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL13              *((volatile unsigned char*)(0x42C61630UL))
#define bFM4_CAN1_MSGVAL_MSGVAL14              *((volatile unsigned char*)(0x42C61634UL))
#define bFM4_CAN1_MSGVAL_MSGVAL15              *((volatile unsigned char*)(0x42C61638UL))
#define bFM4_CAN1_MSGVAL_MSGVAL16              *((volatile unsigned char*)(0x42C6163CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL17              *((volatile unsigned char*)(0x42C61640UL))
#define bFM4_CAN1_MSGVAL_MSGVAL18              *((volatile unsigned char*)(0x42C61644UL))
#define bFM4_CAN1_MSGVAL_MSGVAL19              *((volatile unsigned char*)(0x42C61648UL))
#define bFM4_CAN1_MSGVAL_MSGVAL20              *((volatile unsigned char*)(0x42C6164CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL21              *((volatile unsigned char*)(0x42C61650UL))
#define bFM4_CAN1_MSGVAL_MSGVAL22              *((volatile unsigned char*)(0x42C61654UL))
#define bFM4_CAN1_MSGVAL_MSGVAL23              *((volatile unsigned char*)(0x42C61658UL))
#define bFM4_CAN1_MSGVAL_MSGVAL24              *((volatile unsigned char*)(0x42C6165CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL25              *((volatile unsigned char*)(0x42C61660UL))
#define bFM4_CAN1_MSGVAL_MSGVAL26              *((volatile unsigned char*)(0x42C61664UL))
#define bFM4_CAN1_MSGVAL_MSGVAL27              *((volatile unsigned char*)(0x42C61668UL))
#define bFM4_CAN1_MSGVAL_MSGVAL28              *((volatile unsigned char*)(0x42C6166CUL))
#define bFM4_CAN1_MSGVAL_MSGVAL29              *((volatile unsigned char*)(0x42C61670UL))
#define bFM4_CAN1_MSGVAL_MSGVAL30              *((volatile unsigned char*)(0x42C61674UL))
#define bFM4_CAN1_MSGVAL_MSGVAL31              *((volatile unsigned char*)(0x42C61678UL))
#define bFM4_CAN1_MSGVAL_MSGVAL32              *((volatile unsigned char*)(0x42C6167CUL))
#define bFM4_CAN1_MSGVAL1_MSGVAL1              *((volatile unsigned char*)(0x42C61600UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL2              *((volatile unsigned char*)(0x42C61604UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL3              *((volatile unsigned char*)(0x42C61608UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL4              *((volatile unsigned char*)(0x42C6160CUL))
#define bFM4_CAN1_MSGVAL1_MSGVAL5              *((volatile unsigned char*)(0x42C61610UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL6              *((volatile unsigned char*)(0x42C61614UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL7              *((volatile unsigned char*)(0x42C61618UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL8              *((volatile unsigned char*)(0x42C6161CUL))
#define bFM4_CAN1_MSGVAL1_MSGVAL9              *((volatile unsigned char*)(0x42C61620UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL10             *((volatile unsigned char*)(0x42C61624UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL11             *((volatile unsigned char*)(0x42C61628UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL12             *((volatile unsigned char*)(0x42C6162CUL))
#define bFM4_CAN1_MSGVAL1_MSGVAL13             *((volatile unsigned char*)(0x42C61630UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL14             *((volatile unsigned char*)(0x42C61634UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL15             *((volatile unsigned char*)(0x42C61638UL))
#define bFM4_CAN1_MSGVAL1_MSGVAL16             *((volatile unsigned char*)(0x42C6163CUL))
#define bFM4_CAN1_MSGVAL2_MSGVAL17             *((volatile unsigned char*)(0x42C61640UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL18             *((volatile unsigned char*)(0x42C61644UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL19             *((volatile unsigned char*)(0x42C61648UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL20             *((volatile unsigned char*)(0x42C6164CUL))
#define bFM4_CAN1_MSGVAL2_MSGVAL21             *((volatile unsigned char*)(0x42C61650UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL22             *((volatile unsigned char*)(0x42C61654UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL23             *((volatile unsigned char*)(0x42C61658UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL24             *((volatile unsigned char*)(0x42C6165CUL))
#define bFM4_CAN1_MSGVAL2_MSGVAL25             *((volatile unsigned char*)(0x42C61660UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL26             *((volatile unsigned char*)(0x42C61664UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL27             *((volatile unsigned char*)(0x42C61668UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL28             *((volatile unsigned char*)(0x42C6166CUL))
#define bFM4_CAN1_MSGVAL2_MSGVAL29             *((volatile unsigned char*)(0x42C61670UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL30             *((volatile unsigned char*)(0x42C61674UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL31             *((volatile unsigned char*)(0x42C61678UL))
#define bFM4_CAN1_MSGVAL2_MSGVAL32             *((volatile unsigned char*)(0x42C6167CUL))

