MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2CC8L0AGL2000A/mcu.h
#define bFM4_ETHERNET_MAC0_TSAR_TSAR10         *((volatile unsigned char*)(0x42C8E328UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR11         *((volatile unsigned char*)(0x42C8E32CUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR12         *((volatile unsigned char*)(0x42C8E330UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR13         *((volatile unsigned char*)(0x42C8E334UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR14         *((volatile unsigned char*)(0x42C8E338UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR15         *((volatile unsigned char*)(0x42C8E33CUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR16         *((volatile unsigned char*)(0x42C8E340UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR17         *((volatile unsigned char*)(0x42C8E344UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR18         *((volatile unsigned char*)(0x42C8E348UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR19         *((volatile unsigned char*)(0x42C8E34CUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR20         *((volatile unsigned char*)(0x42C8E350UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR21         *((volatile unsigned char*)(0x42C8E354UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR22         *((volatile unsigned char*)(0x42C8E358UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR23         *((volatile unsigned char*)(0x42C8E35CUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR24         *((volatile unsigned char*)(0x42C8E360UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR25         *((volatile unsigned char*)(0x42C8E364UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR26         *((volatile unsigned char*)(0x42C8E368UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR27         *((volatile unsigned char*)(0x42C8E36CUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR28         *((volatile unsigned char*)(0x42C8E370UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR29         *((volatile unsigned char*)(0x42C8E374UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR30         *((volatile unsigned char*)(0x42C8E378UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR31         *((volatile unsigned char*)(0x42C8E37CUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR0          *((volatile unsigned char*)(0x42C8E380UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR1          *((volatile unsigned char*)(0x42C8E384UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR2          *((volatile unsigned char*)(0x42C8E388UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR3          *((volatile unsigned char*)(0x42C8E38CUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR4          *((volatile unsigned char*)(0x42C8E390UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR5          *((volatile unsigned char*)(0x42C8E394UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR6          *((volatile unsigned char*)(0x42C8E398UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR7          *((volatile unsigned char*)(0x42C8E39CUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR8          *((volatile unsigned char*)(0x42C8E3A0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR9          *((volatile unsigned char*)(0x42C8E3A4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR10         *((volatile unsigned char*)(0x42C8E3A8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR11         *((volatile unsigned char*)(0x42C8E3ACUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR12         *((volatile unsigned char*)(0x42C8E3B0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR13         *((volatile unsigned char*)(0x42C8E3B4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR14         *((volatile unsigned char*)(0x42C8E3B8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR15         *((volatile unsigned char*)(0x42C8E3BCUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR16         *((volatile unsigned char*)(0x42C8E3C0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR17         *((volatile unsigned char*)(0x42C8E3C4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR18         *((volatile unsigned char*)(0x42C8E3C8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR19         *((volatile unsigned char*)(0x42C8E3CCUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR20         *((volatile unsigned char*)(0x42C8E3D0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR21         *((volatile unsigned char*)(0x42C8E3D4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR22         *((volatile unsigned char*)(0x42C8E3D8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR23         *((volatile unsigned char*)(0x42C8E3DCUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR24         *((volatile unsigned char*)(0x42C8E3E0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR25         *((volatile unsigned char*)(0x42C8E3E4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR26         *((volatile unsigned char*)(0x42C8E3E8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR27         *((volatile unsigned char*)(0x42C8E3ECUL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR28         *((volatile unsigned char*)(0x42C8E3F0UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR29         *((volatile unsigned char*)(0x42C8E3F4UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR30         *((volatile unsigned char*)(0x42C8E3F8UL))
#define bFM4_ETHERNET_MAC0_TTSR_TSTR31         *((volatile unsigned char*)(0x42C8E3FCUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR0          *((volatile unsigned char*)(0x42C8E400UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR1          *((volatile unsigned char*)(0x42C8E404UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR2          *((volatile unsigned char*)(0x42C8E408UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR3          *((volatile unsigned char*)(0x42C8E40CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR4          *((volatile unsigned char*)(0x42C8E410UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR5          *((volatile unsigned char*)(0x42C8E414UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR6          *((volatile unsigned char*)(0x42C8E418UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR7          *((volatile unsigned char*)(0x42C8E41CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR8          *((volatile unsigned char*)(0x42C8E420UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR9          *((volatile unsigned char*)(0x42C8E424UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR10         *((volatile unsigned char*)(0x42C8E428UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR11         *((volatile unsigned char*)(0x42C8E42CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR12         *((volatile unsigned char*)(0x42C8E430UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR13         *((volatile unsigned char*)(0x42C8E434UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR14         *((volatile unsigned char*)(0x42C8E438UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR15         *((volatile unsigned char*)(0x42C8E43CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR16         *((volatile unsigned char*)(0x42C8E440UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR17         *((volatile unsigned char*)(0x42C8E444UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR18         *((volatile unsigned char*)(0x42C8E448UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR19         *((volatile unsigned char*)(0x42C8E44CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR20         *((volatile unsigned char*)(0x42C8E450UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR21         *((volatile unsigned char*)(0x42C8E454UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR22         *((volatile unsigned char*)(0x42C8E458UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR23         *((volatile unsigned char*)(0x42C8E45CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR24         *((volatile unsigned char*)(0x42C8E460UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR25         *((volatile unsigned char*)(0x42C8E464UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR26         *((volatile unsigned char*)(0x42C8E468UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR27         *((volatile unsigned char*)(0x42C8E46CUL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR28         *((volatile unsigned char*)(0x42C8E470UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR29         *((volatile unsigned char*)(0x42C8E474UL))
#define bFM4_ETHERNET_MAC0_TTNR_TSTR30         *((volatile unsigned char*)(0x42C8E478UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR0       *((volatile unsigned char*)(0x42C8E480UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR1       *((volatile unsigned char*)(0x42C8E484UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR2       *((volatile unsigned char*)(0x42C8E488UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR3       *((volatile unsigned char*)(0x42C8E48CUL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR4       *((volatile unsigned char*)(0x42C8E490UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR5       *((volatile unsigned char*)(0x42C8E494UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR6       *((volatile unsigned char*)(0x42C8E498UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR7       *((volatile unsigned char*)(0x42C8E49CUL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR8       *((volatile unsigned char*)(0x42C8E4A0UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR9       *((volatile unsigned char*)(0x42C8E4A4UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR10      *((volatile unsigned char*)(0x42C8E4A8UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR11      *((volatile unsigned char*)(0x42C8E4ACUL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR12      *((volatile unsigned char*)(0x42C8E4B0UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR13      *((volatile unsigned char*)(0x42C8E4B4UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR14      *((volatile unsigned char*)(0x42C8E4B8UL))
#define bFM4_ETHERNET_MAC0_STHWSR_TSHWR15      *((volatile unsigned char*)(0x42C8E4BCUL))
#define bFM4_ETHERNET_MAC0_TSR_TSSOVF          *((volatile unsigned char*)(0x42C8E500UL))
#define bFM4_ETHERNET_MAC0_TSR_TSTART          *((volatile unsigned char*)(0x42C8E504UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSTS           *((volatile unsigned char*)(0x42C8E508UL))
#define bFM4_ETHERNET_MAC0_TSR_TRGTER          *((volatile unsigned char*)(0x42C8E50CUL))
#define bFM4_ETHERNET_MAC0_TSR_ATSSTM          *((volatile unsigned char*)(0x42C8E560UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSNS0          *((volatile unsigned char*)(0x42C8E564UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSNS1          *((volatile unsigned char*)(0x42C8E568UL))
#define bFM4_ETHERNET_MAC0_TSR_ATSNS2          *((volatile unsigned char*)(0x42C8E56CUL))
#define bFM4_ETHERNET_MAC0_PPSCR_PPSCTRL0      *((volatile unsigned char*)(0x42C8E580UL))
#define bFM4_ETHERNET_MAC0_PPSCR_PPSCTRL1      *((volatile unsigned char*)(0x42C8E584UL))
#define bFM4_ETHERNET_MAC0_PPSCR_PPSCTRL2      *((volatile unsigned char*)(0x42C8E588UL))
#define bFM4_ETHERNET_MAC0_PPSCR_PPSCTRL3      *((volatile unsigned char*)(0x42C8E58CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN0           *((volatile unsigned char*)(0x42C8E600UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN1           *((volatile unsigned char*)(0x42C8E604UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN2           *((volatile unsigned char*)(0x42C8E608UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN3           *((volatile unsigned char*)(0x42C8E60CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN4           *((volatile unsigned char*)(0x42C8E610UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN5           *((volatile unsigned char*)(0x42C8E614UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN6           *((volatile unsigned char*)(0x42C8E618UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN7           *((volatile unsigned char*)(0x42C8E61CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN8           *((volatile unsigned char*)(0x42C8E620UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN9           *((volatile unsigned char*)(0x42C8E624UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN10          *((volatile unsigned char*)(0x42C8E628UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN11          *((volatile unsigned char*)(0x42C8E62CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN12          *((volatile unsigned char*)(0x42C8E630UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN13          *((volatile unsigned char*)(0x42C8E634UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN14          *((volatile unsigned char*)(0x42C8E638UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN15          *((volatile unsigned char*)(0x42C8E63CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN16          *((volatile unsigned char*)(0x42C8E640UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN17          *((volatile unsigned char*)(0x42C8E644UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN18          *((volatile unsigned char*)(0x42C8E648UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN19          *((volatile unsigned char*)(0x42C8E64CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN20          *((volatile unsigned char*)(0x42C8E650UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN21          *((volatile unsigned char*)(0x42C8E654UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN22          *((volatile unsigned char*)(0x42C8E658UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN23          *((volatile unsigned char*)(0x42C8E65CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN24          *((volatile unsigned char*)(0x42C8E660UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN25          *((volatile unsigned char*)(0x42C8E664UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN26          *((volatile unsigned char*)(0x42C8E668UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN27          *((volatile unsigned char*)(0x42C8E66CUL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN28          *((volatile unsigned char*)(0x42C8E670UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN29          *((volatile unsigned char*)(0x42C8E674UL))
#define bFM4_ETHERNET_MAC0_ATNR_ATN30          *((volatile unsigned char*)(0x42C8E678UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS0           *((volatile unsigned char*)(0x42C8E680UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS1           *((volatile unsigned char*)(0x42C8E684UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS2           *((volatile unsigned char*)(0x42C8E688UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS3           *((volatile unsigned char*)(0x42C8E68CUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS4           *((volatile unsigned char*)(0x42C8E690UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS5           *((volatile unsigned char*)(0x42C8E694UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS6           *((volatile unsigned char*)(0x42C8E698UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS7           *((volatile unsigned char*)(0x42C8E69CUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS8           *((volatile unsigned char*)(0x42C8E6A0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS9           *((volatile unsigned char*)(0x42C8E6A4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS10          *((volatile unsigned char*)(0x42C8E6A8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS11          *((volatile unsigned char*)(0x42C8E6ACUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS12          *((volatile unsigned char*)(0x42C8E6B0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS13          *((volatile unsigned char*)(0x42C8E6B4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS14          *((volatile unsigned char*)(0x42C8E6B8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS15          *((volatile unsigned char*)(0x42C8E6BCUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS16          *((volatile unsigned char*)(0x42C8E6C0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS17          *((volatile unsigned char*)(0x42C8E6C4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS18          *((volatile unsigned char*)(0x42C8E6C8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS19          *((volatile unsigned char*)(0x42C8E6CCUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS20          *((volatile unsigned char*)(0x42C8E6D0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS21          *((volatile unsigned char*)(0x42C8E6D4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS22          *((volatile unsigned char*)(0x42C8E6D8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS23          *((volatile unsigned char*)(0x42C8E6DCUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS24          *((volatile unsigned char*)(0x42C8E6E0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS25          *((volatile unsigned char*)(0x42C8E6E4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS26          *((volatile unsigned char*)(0x42C8E6E8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS27          *((volatile unsigned char*)(0x42C8E6ECUL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS28          *((volatile unsigned char*)(0x42C8E6F0UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS29          *((volatile unsigned char*)(0x42C8E6F4UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS30          *((volatile unsigned char*)(0x42C8E6F8UL))
#define bFM4_ETHERNET_MAC0_ATSR_ATS31          *((volatile unsigned char*)(0x42C8E6FCUL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC0         *((volatile unsigned char*)(0x42C90060UL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC1         *((volatile unsigned char*)(0x42C90064UL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC2         *((volatile unsigned char*)(0x42C90068UL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC3         *((volatile unsigned char*)(0x42C9006CUL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC4         *((volatile unsigned char*)(0x42C90070UL))
#define bFM4_ETHERNET_MAC0_MAR16H_MBC5         *((volatile unsigned char*)(0x42C90074UL))
#define bFM4_ETHERNET_MAC0_MAR16H_SA           *((volatile unsigned char*)(0x42C90078UL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC0         *((volatile unsigned char*)(0x42C90160UL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC1         *((volatile unsigned char*)(0x42C90164UL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC2         *((volatile unsigned char*)(0x42C90168UL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC3         *((volatile unsigned char*)(0x42C9016CUL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC4         *((volatile unsigned char*)(0x42C90170UL))
#define bFM4_ETHERNET_MAC0_MAR17H_MBC5         *((volatile unsigned char*)(0x42C90174UL))
#define bFM4_ETHERNET_MAC0_MAR17H_SA           *((volatile unsigned char*)(0x42C90178UL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC0         *((volatile unsigned char*)(0x42C90260UL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC1         *((volatile unsigned char*)(0x42C90264UL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC2         *((volatile unsigned char*)(0x42C90268UL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC3         *((volatile unsigned char*)(0x42C9026CUL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC4         *((volatile unsigned char*)(0x42C90270UL))
#define bFM4_ETHERNET_MAC0_MAR18H_MBC5         *((volatile unsigned char*)(0x42C90274UL))
#define bFM4_ETHERNET_MAC0_MAR18H_SA           *((volatile unsigned char*)(0x42C90278UL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC0         *((volatile unsigned char*)(0x42C90360UL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC1         *((volatile unsigned char*)(0x42C90364UL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC2         *((volatile unsigned char*)(0x42C90368UL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC3         *((volatile unsigned char*)(0x42C9036CUL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC4         *((volatile unsigned char*)(0x42C90370UL))
#define bFM4_ETHERNET_MAC0_MAR19H_MBC5         *((volatile unsigned char*)(0x42C90374UL))
#define bFM4_ETHERNET_MAC0_MAR19H_SA           *((volatile unsigned char*)(0x42C90378UL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC0         *((volatile unsigned char*)(0x42C90460UL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC1         *((volatile unsigned char*)(0x42C90464UL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC2         *((volatile unsigned char*)(0x42C90468UL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC3         *((volatile unsigned char*)(0x42C9046CUL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC4         *((volatile unsigned char*)(0x42C90470UL))
#define bFM4_ETHERNET_MAC0_MAR20H_MBC5         *((volatile unsigned char*)(0x42C90474UL))
#define bFM4_ETHERNET_MAC0_MAR20H_SA           *((volatile unsigned char*)(0x42C90478UL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC0         *((volatile unsigned char*)(0x42C90560UL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC1         *((volatile unsigned char*)(0x42C90564UL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC2         *((volatile unsigned char*)(0x42C90568UL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC3         *((volatile unsigned char*)(0x42C9056CUL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC4         *((volatile unsigned char*)(0x42C90570UL))
#define bFM4_ETHERNET_MAC0_MAR21H_MBC5         *((volatile unsigned char*)(0x42C90574UL))
#define bFM4_ETHERNET_MAC0_MAR21H_SA           *((volatile unsigned char*)(0x42C90578UL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC0         *((volatile unsigned char*)(0x42C90660UL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC1         *((volatile unsigned char*)(0x42C90664UL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC2         *((volatile unsigned char*)(0x42C90668UL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC3         *((volatile unsigned char*)(0x42C9066CUL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC4         *((volatile unsigned char*)(0x42C90670UL))
#define bFM4_ETHERNET_MAC0_MAR22H_MBC5         *((volatile unsigned char*)(0x42C90674UL))
#define bFM4_ETHERNET_MAC0_MAR22H_SA           *((volatile unsigned char*)(0x42C90678UL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC0         *((volatile unsigned char*)(0x42C90760UL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC1         *((volatile unsigned char*)(0x42C90764UL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC2         *((volatile unsigned char*)(0x42C90768UL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC3         *((volatile unsigned char*)(0x42C9076CUL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC4         *((volatile unsigned char*)(0x42C90770UL))
#define bFM4_ETHERNET_MAC0_MAR23H_MBC5         *((volatile unsigned char*)(0x42C90774UL))
#define bFM4_ETHERNET_MAC0_MAR23H_SA           *((volatile unsigned char*)(0x42C90778UL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC0         *((volatile unsigned char*)(0x42C90860UL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC1         *((volatile unsigned char*)(0x42C90864UL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC2         *((volatile unsigned char*)(0x42C90868UL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC3         *((volatile unsigned char*)(0x42C9086CUL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC4         *((volatile unsigned char*)(0x42C90870UL))
#define bFM4_ETHERNET_MAC0_MAR24H_MBC5         *((volatile unsigned char*)(0x42C90874UL))
#define bFM4_ETHERNET_MAC0_MAR24H_SA           *((volatile unsigned char*)(0x42C90878UL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC0         *((volatile unsigned char*)(0x42C90960UL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC1         *((volatile unsigned char*)(0x42C90964UL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC2         *((volatile unsigned char*)(0x42C90968UL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC3         *((volatile unsigned char*)(0x42C9096CUL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC4         *((volatile unsigned char*)(0x42C90970UL))
#define bFM4_ETHERNET_MAC0_MAR25H_MBC5         *((volatile unsigned char*)(0x42C90974UL))
#define bFM4_ETHERNET_MAC0_MAR25H_SA           *((volatile unsigned char*)(0x42C90978UL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC0         *((volatile unsigned char*)(0x42C90A60UL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC1         *((volatile unsigned char*)(0x42C90A64UL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC2         *((volatile unsigned char*)(0x42C90A68UL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC3         *((volatile unsigned char*)(0x42C90A6CUL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC4         *((volatile unsigned char*)(0x42C90A70UL))
#define bFM4_ETHERNET_MAC0_MAR26H_MBC5         *((volatile unsigned char*)(0x42C90A74UL))
#define bFM4_ETHERNET_MAC0_MAR26H_SA           *((volatile unsigned char*)(0x42C90A78UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC0         *((volatile unsigned char*)(0x42C90B60UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC1         *((volatile unsigned char*)(0x42C90B64UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC2         *((volatile unsigned char*)(0x42C90B68UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC3         *((volatile unsigned char*)(0x42C90B6CUL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC4         *((volatile unsigned char*)(0x42C90B70UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC5         *((volatile unsigned char*)(0x42C90B74UL))
#define bFM4_ETHERNET_MAC0_MAR27H_SA           *((volatile unsigned char*)(0x42C90B78UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC0         *((volatile unsigned char*)(0x42C90C60UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC1         *((volatile unsigned char*)(0x42C90C64UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC2         *((volatile unsigned char*)(0x42C90C68UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC3         *((volatile unsigned char*)(0x42C90C6CUL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC4         *((volatile unsigned char*)(0x42C90C70UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC5         *((volatile unsigned char*)(0x42C90C74UL))
